[{"id":"f36ada0a-a846-11e5-9481-fb16657520ce","created_at":"Thu Dec 22 00:57:18 UTC 2016","title":"Learning & Development Coordinator","location":"San Francisco ","type":"Full Time","description":"<p>GitHub is changing the way people build software. Come be a part of building a Learning &amp; Development team that believes learning should be innovative, people-centered and fun!  If you are extremely organized, think of obstacles as learning opportunities and are passionate about helping people grow, then this is the gig for you.</p>\n\n<p>We want you to join our team as the Learning &amp; Development Coordinator to manage all training operations, logistics, marketing, and assessment for L&amp;D programs.  Defining our learning management systems and processes will also be an important aspect of this role.  This person will collaborate with other functional training teams across the organization to ensure systems and processes are aligned, complementary and effectively using resources.  </p>\n\n<p>This role is based in our HQ located in San Francisco.  Some travel should be expected.  </p>\n\n<h4>The Gig:</h4>\n\n<ul>\n<li>Coordinate and administer logistics to support all L&amp;D programs, including leadership and professional development </li>\n<li>Create processes to ensure smooth implementation of L&amp;D programs, including scheduling, materials production, and training evaluations</li>\n<li>Assess and implement a Learning Management solution to schedule and track training</li>\n<li>Develop and maintain communications to market all learning program offerings to diverse audiences within GitHub</li>\n<li>Assist in the development and facilitation of core L&amp;D programs and benefits, such as mentoring and eLearning</li>\n<li>Partner with other functional training teams to identify synergies and resolve conflicts</li>\n</ul>\n\n<h4>Qualifications:</h4>\n\n<ul>\n<li>Relevant experience managing multiple projects at once in a fast-paced and rapidly changing environment</li>\n<li>Strong project planning and organizational skills with demonstrated ability to meet key milestones on time and with quality</li>\n<li>Client service orientation with excellent attention to detail and follow-through</li>\n<li>Strong communication and relationship building skills</li>\n<li>Excellent critical thinking and problem solving skills</li>\n<li>Must be legally authorized to work in the U.S. </li>\n</ul>\n\n<h4>Bonus if you have:</h4>\n\n<ul>\n<li>Knowledge of Git and experience using GitHub</li>\n<li>Prior experience in a learning and development role</li>\n</ul>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested? </p>\n\n<p>We would love to hear more about you and your interest in the role at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/718bedf9-f331-4cfa-8ad4-5646214e522e\">here</a>.</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/74b4ba1e-a846-11e5-90f2-815487ed15b6.png","url":"http://jobs.github.com/positions/f36ada0a-a846-11e5-9481-fb16657520ce"},{"id":"99b75180-a839-11e5-99fe-c4240d26db1a","created_at":"Wed Dec 21 23:21:45 UTC 2016","title":"Senior Human Resources Partner","location":"San Francisco ","type":"Full Time","description":"<p>GitHub is where software gets built. We were named TechCrunch&#39;s Best Overall Startup (2012), one of Entrepreneur Magazine&#39;s 100 Brilliant Companies (2013), one of Fast Company&#39;s Most Innovative Companies (2013), a World Economic Forum Technology Pioneer (2014), as well as one of MIT&#39;s 50 Smartest Companies in the World (2014). We&#39;re a private, growing company headquartered in San Francisco, with a growing, global corporate presence and customers all over the world.</p>\n\n<p>Like the rest of the software world, our HR team uses GitHub internally to work more collaboratively, transparently, and efficiently. We believe strongly in working together with GitHubbers to have open discussions and to share different ideas. </p>\n\n<p><strong>The Gig</strong></p>\n\n<p>We are looking for a Senior Human Resources Partner to support and work with our growing teams.  Our Dedicated HR Partners work very closely with the GitHubbers of each internal team  to provide day to day support/guidance, implement various company wide programs, help with organization planning, and implement team specific initiatives based on GitHubbers’ feedback/needs.  We work with integrity and openness in supporting both Managers and GitHubbers with the goal of  team members feeling comfortable coming to us for counsel, support and ideas at anytime.</p>\n\n<p><strong><em>Responsibilities</em></strong></p>\n\n<ul>\n<li>Work closely with functional leaders on organizational planning and team development.</li>\n<li>Build trust with GitHubbers through regular sync-ups; and increase overall happiness and engagement.</li>\n<li>Manage and help resolve complex employee relations issues; conduct effective, thorough and objective investigations as needed.</li>\n<li>Partner with the Talent Acquisition and Business leaders on workforce planning and recruiting efforts.</li>\n<li>Identify and surface opportunities to advance the effectiveness of our teams; and work with them to develop initiatives and programs to address them. </li>\n<li>Coaching all levels of people managers on how they can be effective communicators, leaders and mentors.</li>\n<li>Assist GitHubbers in providing feedback to their managers to help them be effective leaders; assist managers in providing thoughtful feedback to their team members so GitHubbers feel supported to do great work at GitHub.</li>\n<li>Drive and facilitate various company wide people-oriented programs around performance feedback, career building, and/or rewards &amp; recognitions. </li>\n<li>Partner with the Development &amp; Engagement team to help identify and provide specific skill advancement opportunities.</li>\n</ul>\n\n<p><strong><em>Qualifications</em></strong></p>\n\n<ul>\n<li>7+ years of progressive HR experience; with at least a couple years in the role of a HR Partner.</li>\n<li>Strong coaching, organizational development and change management skills</li>\n<li>A creative mindset.</li>\n<li>Demonstrated success in problem solving</li>\n<li>A background in working with technical and engineering organization a plus.</li>\n<li>Ability to do some travel as needed domestically and internationally. Travel estimated to be about 10-15%.</li>\n</ul>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested?</p>\n\n<p>We would love to hear more about you and your interest in joining us at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/5588b446-aef3-4b3c-b4fd-ee89928b222b\">here</a>.</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/76ea1bb0-a839-11e5-8db6-82647a5ede86.png","url":"http://jobs.github.com/positions/99b75180-a839-11e5-99fe-c4240d26db1a"},{"id":"0dd1aaa8-a226-11e5-8994-ea284958636a","created_at":"Wed Dec 14 05:46:42 UTC 2016","title":"Sr Manager, Learning & Development","location":"Multiple","type":"Full Time","description":"<p>GitHub is changing the way people build software. Come be a part of building a Learning &amp; Development team that believes learning should be innovative, people-centered and fun!  If you have a tendency to challenge the status quo, call yourself &quot;right-brained&quot; more often than not, and are passionate about helping people grow, then this is the gig for you.</p>\n\n<p>We want you to join our team as the Senior Manager, Learning &amp; Development to help us build the leadership capabilities of GitHub’s managers.  You’ll primarily be responsible for creating a foundational management curriculum and programs to support practice and reinforce learning over time.  Supporting employees’ career growth through other professional development programs will also be an important aspect of this role.  You will design and execute innovative enterprise-wide leadership and social learning opportunities that leverage both GitHub’s internal tools as well as current best practices in talent development. </p>\n\n<p>In keeping with our philosophy of work anywhere, anytime, this role can be based in SF or remotely in one of the 33 U.S. states that we are currently set up to hire from. Some travel should be expected. </p>\n\n<h4>The Gig:</h4>\n\n<ul>\n<li>Develop and manage our global manager and professional development programs, with special emphasis on meeting the needs of a globally distributed workforce</li>\n<li>Design and facilitate workshops on various topics as needed, such as basic interviewing, performance management, leveraging employee feedback, etc. </li>\n<li>Partner with key stakeholders around the company to Identify and develop new talent programs that address emerging needs, such as mentoring or rotational experiences </li>\n<li>Create learning “laboratories” to experiment with ways to practice skill building and share learning across the organization using both in-person and virtual tools</li>\n<li>Identify external partners for training content and delivery and manage all aspects of these relationships, from contract negotiation to scheduling</li>\n<li>Conduct training needs assessments through surveying, focus groups and interviews.</li>\n<li>Develop metrics and methods for evaluating effectiveness of established programs.</li>\n</ul>\n\n<h4>Qualifications:</h4>\n\n<ul>\n<li>Must be legally authorized to work in the U.S. </li>\n<li>Relevant experience designing and implementing impactful learning and development programs for a diverse and distributed workforce</li>\n<li>Demonstrated expertise in leadership development and the latest learning technologies</li>\n<li>Proven ability to develop data-driven recommendations </li>\n<li>Strong facilitation and written communication skills</li>\n<li>Excellent coaching and relationship building skills</li>\n<li>Strong project management skills</li>\n<li>Highly adaptable to a rapidly changing environment. </li>\n</ul>\n\n<h4>Bonus if you have:</h4>\n\n<ul>\n<li>Knowledge of Git and experience using GitHub</li>\n<li>Certification in any assessment instruments, such as MBTI, Situational Leadership, Enneagram, etc.</li>\n<li>Content creation experience using a variety of authoring tools such as: video, Prezi, Audacity, etc.</li>\n</ul>\n\n<p>About GitHub</p>\n\n<p>Who we are</p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p>Why you should join</p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</p>\n\n<p>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest to join us! Just fill out our application <a href=\"https://jobs.lever.co/github/ce39757c-b659-4a29-b5d8-f46a3025896c\">here</a></p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/ecdb9b06-a225-11e5-9b62-b1c88006aa2d.png","url":"http://jobs.github.com/positions/0dd1aaa8-a226-11e5-8994-ea284958636a"},{"id":"5b73d710-9ac7-11e5-9f04-450505977877","created_at":"Sun Dec 04 20:41:12 UTC 2016","title":"Terms-of-Service Support Specialist","location":"Remote","type":"Full Time","description":"<p>The GitHub Terms of Service Support team is looking for full-time team members in our SF office or worldwide! GitHub users work 24/7, so you&#39;ll occasionally need to adjust your work week to help cover a weekend or holiday (don&#39;t worry! We strongly support flexible schedules that let you to take care of the important things in your life).</p>\n\n<p>When GitHub users have questions, they email support. We help people as quickly <em>and awesomely</em> as possible. Our Terms of Service team supports users with issues related to site policy, including DMCA takedowns, trademarks, spam and abuse, and privacy. This requires a logical brain, good intuition and problem solving skills, plus the ability to objectively apply GitHub&#39;s values to a variety of socially and emotionally sensitive topics. We work closely with GitHub&#39;s Legal team, so an interest in law is also an asset.</p>\n\n<p>The most important characteristic of our support team is that we love helping developers. The Terms of Service Support team specifically helps people understand and follow the policies that make GitHub a place for people to work better, together.</p>\n\n<p>Our support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.</p>\n\n<h2>You must have:</h2>\n\n<ul>\n<li>Stellar English and grammar skills</li>\n<li>Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution</li>\n<li>A strong sense of empathy and the ability to advocate for others </li>\n<li>A unique writing style and voice</li>\n</ul>\n\n<h2>Bonus if you have:</h2>\n\n<ul>\n<li>Prior customer support experience</li>\n<li>Experience in law, policy-related, or regulatory fields</li>\n<li>Experience working remotely</li>\n</ul>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in the Terms-of-Service Support Specialist role at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/00bcbe2e-d5eb-4fe0-827c-a7d4068db618\">here</a></p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/449ad566-9ac7-11e5-8307-b2f981f60e69.png","url":"http://jobs.github.com/positions/5b73d710-9ac7-11e5-9f04-450505977877"},{"id":"0707ef8e-89bc-11e5-98ff-669970617412","created_at":"Sun Nov 13 04:07:16 UTC 2016","title":"Support Tools Engineering Manager","location":"Remote","type":"Full Time","description":"<h1>Job Description</h1>\n\n<p>It takes great tools to give great support to GitHub&#39;s 10 million users and that is why GitHub is looking for an experienced manager to help grow and strengthen a team of engineers focused on internal support tools at GitHub. As the Suppot Tools Engineering Manager, you will lead developers, advocate for them, guide technical decisions, hire a diverse group of incredibly talented people, and more. The manager will work closely with the Support teams to help determine what tools would make their work more efficient and their lives easier.</p>\n\n<p>This role requires a diverse set of skills, from guiding and coaching engineers to managing multiple projects simultaneously. You should be able to collaborate with teams across all parts of the company and facilitate discussions regarding product prioritization and development.</p>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h2>Responsibilities</h2>\n\n<ul>\n<li>Meeting 1-1 with team members on a regular basis</li>\n<li>Planning and supporting career development</li>\n<li>Giving guided performance feedback</li>\n<li>Serving as hiring manager for the team</li>\n<li>Staffing projects effectively</li>\n<li>Guiding the development team’s vision, best practices, and priorities</li>\n<li>Reviewing code and leading small group discussions about engineering issues</li>\n<li>Working with support teams to define and prioritize projects</li>\n</ul>\n\n<h2>You should have</h2>\n\n<ul>\n<li>2+ years of experience managing small to medium engineering teams</li>\n<li>Experience developing internal tools</li>\n<li>Strong empathy for GitHub users and GitHub Support</li>\n<li>Excellent communication skills, especially when working with a distributed team</li>\n<li>Knowledge of Git and GitHub Flow</li>\n</ul>\n\n<h3>Bonus points if you have experience with</h3>\n\n<ul>\n<li>Technical support for a web application</li>\n<li>Ruby and Ruby on Rails</li>\n<li>JavaScript or CoffeeScript</li>\n<li>Elasticsearch</li>\n<li>AWS or similar cloud computing operations</li>\n<li>Jekyll or other static site generators</li>\n<li>Darwin Information Typing Architecture (DITA) authoring and publishing</li>\n</ul>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p>**Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!*</p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in the Enterprise Support Account Engineer role at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/17bfb8c5-53da-4d43-8fb9-70c348b3a01c\">here</a>.</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/04153fac-89bc-11e5-95ab-77749e499773.png","url":"http://jobs.github.com/positions/0707ef8e-89bc-11e5-98ff-669970617412"},{"id":"ec250a62-8998-11e5-896b-691b105c69f8","created_at":"Sat Nov 12 23:55:59 UTC 2016","title":"Accounts Support","location":"Remote","type":"Full Time","description":"<p>The GitHub Accounts Support team is looking for full-time team members in our SF office or worldwide! We are particularly in need of folks in Asia-Pacific and Europe.</p>\n\n<p>When GitHub users have questions, they email support. We help people as quickly <em>and awesomely</em> as possible. Our Account Support team handle passwords, <a href=\"https://help.github.com/articles/setting-up-email-verification\">email verification</a>, billing, legal, spam and abuse, <a href=\"https://help.github.com/articles/what-happens-if-my-account-is-locked\">account lockouts</a>, fraud, and helping people choose <a href=\"https://github.com/pricing\">plans</a>. This requires a logical brain and a spidey sense for problems.</p>\n\n<p>The most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we&#39;d want someone to treat our friends.</p>\n\n<p>Our support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.</p>\n\n<h2>You must have:</h2>\n\n<ul>\n<li>Stellar English and grammar skills</li>\n<li>Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution</li>\n<li>A strong sense of empathy and the ability to advocate for others </li>\n<li>A unique writing style and voice</li>\n</ul>\n\n<h2>Bonus if you have:</h2>\n\n<ul>\n<li>Prior customer support experience</li>\n<li>Technical experience (QA, documentation, elaborate boardgames)</li>\n<li>Experience working remotely</li>\n</ul>\n\n<p><em>Developers: this probably isn&#39;t the job for you, but perhaps you have a friend who would be a perfect fit. Send them this link. Thanks!</em></p>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested?</p>\n\n<p>We would love to hear more about you and your interest in joining us at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/278336ea-7b76-47ea-9f78-1389239bdbf4\">here</a>.</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/e51a0286-8998-11e5-9c3d-6d8298125ce6.png","url":"http://jobs.github.com/positions/ec250a62-8998-11e5-896b-691b105c69f8"},{"id":"ce111c02-901f-11e2-9550-f77fbc10ff2b","created_at":"Sat Nov 12 16:53:30 UTC 2016","title":"Enterprise Support Engineer","location":"Remote","type":"Full Time","description":"<p>GitHub is looking for full time Enterprise Support Engineers in our SF office, The Americas, EMEA and Asia-Pacific!</p>\n\n<p>Enterprise Support Engineers support our <a href=\"https://enterprise.github.com\">GitHub Enterprise</a> product, which our customers install and manage internally in their own virtualization environment.</p>\n\n<p>Your main responsibility will be to work with our customers to solve support tickets. Tickets are usually opened by internal system administrators, and can include investigating load or networking issues, debugging application errors, and discussing feature requests. You&#39;ll also work with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources.</p>\n\n<p>You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people. </p>\n\n<h3>You must have:</h3>\n\n<ul>\n<li>At least 2-3 years of experience working with and troubleshooting Linux servers</li>\n<li>Enthusiasm for working directly with customers</li>\n<li>Ability to communicate technical information clearly</li>\n<li>Stellar English and grammar skills</li>\n<li>Ability to look through and understand code (Ruby / Bash)</li>\n</ul>\n\n<h3>We&#39;d also love you to have:</h3>\n\n<ul>\n<li>Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)</li>\n<li>Experience with server automation systems like Chef or Puppet</li>\n<li>Familiarity with Git and GitHub</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over five million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. Remote GitHubbers also come visit SF often and are encouraged to stay as long as they like!   </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a> are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n","how_to_apply":"<p>Interested? <a href=\"https://jobs.lever.co/github/d6293858-0d46-4c5e-b7ad-c06a5294b32d/apply\">Fill out our application here.</a> We love hearing about past projects and what interests you. Please make sure you provide a link to your GitHub profile!</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/3e419e00-b5c0-11e2-815b-eed1f0baf236.png","url":"http://jobs.github.com/positions/ce111c02-901f-11e2-9550-f77fbc10ff2b"},{"id":"b68af79e-16a3-11e5-8fa4-69d536c7b6a1","created_at":"Sat Nov 12 16:53:30 UTC 2016","title":"Enterprise Senior Support Engineer","location":"Anywhere","type":"Full Time","description":"<p>GitHub is looking for full time Enterprise Senior Support Engineer in North America, EMEA, and APAC!</p>\n\n<p>GitHub Enterprise is used by large companies to help them build great software. Our Enterprise Support team is there to help them keep their appliances running smoothly. Enterprise Senior Support Engineer give some of our largest customers a primary point of contact with our support team. These customers often require unique solutions for scaling and integrating with their infrastructure. As an Enterprise Senior Support Engineer, you&#39;ll work side-by-side with them to help them succeed and thrive.</p>\n\n<h2>Responsibilities</h2>\n\n<ul>\n<li>Work closely with a small number of GitHub Enterprise customers, helping them to be more successful with GitHub over time. You&#39;ll learn about their successes and challenges, share their feedback within GitHub, and advocate for their interests.</li>\n<li>Help solve often highly complex support tickets, usually opened by customer system administrators, using your own technical skills and coordinating responses from our infrastructure and engineering teams. Tickets can include investigation of load or networking issues, debugging application errors, discussing feature requests, and many other issues.</li>\n<li>Respond to emails and phone calls from your customer accounts.</li>\n<li>Initiate outgoing contact with your customer accounts to, for example, coordinate upgrades, communicate upcoming features, and ensure their installation is running smoothly.</li>\n<li>Liaise with our engineering team to prioritize issues and development, and our documentation team to improve customer-facing resources.</li>\n<li>Be available during business hours for urgent responses to customer outages.</li>\n</ul>\n\n<h2>Qualifications</h2>\n\n<ul>\n<li>Significant experience working with and troubleshooting Linux servers</li>\n<li>Enthusiasm for working directly with customers</li>\n<li>Ability to communicate technical information clearly</li>\n<li>Stellar English and grammar skills</li>\n<li>Ability to look through and understand code, especially Ruby and Bash</li>\n</ul>\n\n<h2>Bonus</h2>\n\n<ul>\n<li>Familiarity with production-level virtualization, either cloud based (e.g. AWS, Azure) or on premises (e.g. VMware ESX, KVM) </li>\n<li>Familiarity with Git and GitHub</li>\n<li>Experience with phone support</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in the Enterprise Support Account Engineer role at GitHub! <a href=\"https://jobs.lever.co/github/717ab053-c179-4c4d-9a5c-7bfb46c358e6/apply\">Just fill out our application here.</a></p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/b68af79e-16a3-11e5-8fa4-69d536c7b6a1"},{"id":"aa507dc8-87fa-11e5-945c-bd38d868850c","created_at":"Thu Nov 10 22:30:37 UTC 2016","title":"Director of Product Marketing, Developer","location":"San Francisco, CA","type":"Full Time","description":"<h1>Job Description</h1>\n\n<p>Are you strategic, results-oriented, and a great team builder? Do you want to change the world? Then we have the role for you! GitHub is looking for an exceptional marketing leader to take our developer directed product marketing to the next level. This role is based out of our San Francisco Office. </p>\n\n<p>We believe software is a powerful way to change the world and for that reason, GitHub seeks to empower developers everywhere. We do this by helping developers: </p>\n\n<ul>\n<li>Grow their skills and careers on GitHub </li>\n<li>Collaborate and create with other developers across our network </li>\n<li>Change the world through Open Source software</li>\n<li>And build great things at work, whether they are at a small start-up, a big tech company, or any of the many industries being transformed by software today</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Drive product, positioning, packaging, and pricing strategy globally directed at individual developers, open source communities, and businesses.</li>\n<li>Drive product, positioning, packaging, and pricing strategy globally to help grow our self-serve business via the GitHub website and through other channels.</li>\n<li>Develop a deep understanding of GitHub products, source control management, and the broader application lifecycle management ecosystem.</li>\n<li>Drive competitive analysis and market research to support this work.</li>\n<li>Own product messaging and positioning. Enable internal teams to speak and write effectively about our products.</li>\n<li>Oversee product launch activities including internal readiness, beta programs, documentation, and launch-specific product-focused content.</li>\n<li>Drive internal product education programs.</li>\n<li>Align with the sales department on a product marketing content production calendar.</li>\n<li>Ensure strategy translates to execution on product-focused web content.</li>\n<li>Oversee the creation of external-facing product-focused content including data sheets, solution briefs, whitepapers, and webinars.</li>\n<li>Oversee the creation of internal-facing product-focused content including crib sheets and competitive battle cards.</li>\n</ul>\n\n<h3>Experience needed:</h3>\n\n<ul>\n<li>7+ years in consumer and B2B marketing</li>\n<li>2+ years in management roles, where you have built &amp; managed a team</li>\n<li>Ability to collaborate effectively with all levels of the organization, including managing stakeholders across Sales, Product, and Engineering disciplines</li>\n<li>Excellent written and oral communication skills</li>\n<li>Ability to inspire change, both internally and externally</li>\n<li>Data and results oriented, with a track record of impacting real business metrics</li>\n</ul>\n\n<p>Must be legally authorized to work in the United States</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n","how_to_apply":"<p>Interested?</p>\n\n<p>We would love to hear more about you and your interest in joining us at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/13970df2-47b6-4f79-a49b-cf4ec60254fe/apply\">here</a>.</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/a18dc3d0-87fa-11e5-9136-04ca8b7d71af.png","url":"http://jobs.github.com/positions/aa507dc8-87fa-11e5-945c-bd38d868850c"},{"id":"6c11ab2c-7d91-11e5-96ff-444d647b9a82","created_at":"Fri Oct 28 16:32:04 UTC 2016","title":"Data Scientist","location":"Anywhere","type":"Full Time","description":"<p>GitHub is hiring Data Scientists! </p>\n\n<p>GitHub has more than 10 million users and 30 million monthly visitors who generate an abundance of data. We use\nthat data to inform our product strategy, verify that what we&#39;re shipping is having the impact we want, and \nprovide a more efficient and expansive experience for our users. As a Data Scientist you&#39;ll work closely with \nour product managers and software engineers to implement machine learning algorithms, design statistical models, analyze data, and present findings. Our data work ranges from recommendations and classification to forecasting \nand decision making. We&#39;re hiring a number of positions and so are seeking candidates with significant experience in one or more of these areas.</p>\n\n<h2>Responsibilities</h2>\n\n<ul>\n<li>Surfacing product insights through data inquiry and analysis</li>\n<li>Working with our analytics infrastructure engineers to build upon our data collection, storage, and processing infrastructure</li>\n<li>Developing predictive modeling and machine learning solutions</li>\n<li>Communicating your work to product managers and the wider company</li>\n<li> Work closely with product and engineering to identify and solve relevant product questions</li>\n</ul>\n\n<h2>Qualifications:</h2>\n\n<ul>\n<li>Strong written and verbal communication skills</li>\n<li>Understanding of computer science fundamentals (data structures and algorithms)</li>\n<li>Familiarity with distributed systems</li>\n<li>Proficiency in one or more programming languages</li>\n<li>Fluency in SQL and understanding of relational database technology and query planning (e.g. MySQL, Postgres, Redshift, Hive, Spark SQL, etc.)</li>\n<li>Understanding of efficient computation en masse (e.g. Hadoop, Tez, Kinesis, Samza, etc.)</li>\n</ul>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested? </p>\n\n<p>We would love to hear more about you and your interest in joining us at GitHub! Just fill out our application <a href=\"https://jobs.lever.co/github/9dcbd929-ca6b-4f00-83d3-93d081bfc2f2/apply\">here</a>.</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/9a302f08-7cf4-11e5-986b-e459bfc7d243.png","url":"http://jobs.github.com/positions/6c11ab2c-7d91-11e5-96ff-444d647b9a82"},{"id":"292516f8-7384-11e5-9259-81adabea2f2d","created_at":"Sat Oct 15 21:31:56 UTC 2016","title":"Systems Engineer - Deployment and Automation","location":"Remote","type":"Full Time","description":"<p>GitHub is looking for systems engineers to build tooling and automation to\nsupport the next generation of the infrastructure at the core of all of GitHub&#39;s\nproducts and services.</p>\n\n<p>As GitHub grows, our ability to innovate and move quickly requires\ninfrastructure components that can be repeatedly and quickly assembled into\nfunctional services usable for development, testing, and production. As a\nDeployment and Automation Systems Engineer, you will be responsible for building\nscalable, testable, and repeatable infrastructure through automation.</p>\n\n<p>The Systems team is highly distributed and the right candidate can thrive in an\nenvironment of asynchronous communication. We expect you to have strong written\ncommunication skills and be able to create working relationships with coworkers\nin locations around the globe.</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Regularly perform analysis to determine how an infrastructure component\nmay have evolved from its original design, current documentation, and present\nday cultural understanding.</li>\n<li>Work with stakeholders to understand a component&#39;s required resiliency.</li>\n<li>Write code that can repeatedly and reliably assemble the required components\nto meet the requirements.</li>\n<li>Write tests that verify that functionality.</li>\n<li>Simulate failures of sub-components, document the response, and make\nimprovements to the component until resiliency requirements are met and\nverified.</li>\n</ul>\n\n<h3>Desired Skills &amp; Experience</h3>\n\n<ul>\n<li>Strong understanding of Linux systems, at both high and low level.</li>\n<li>Experience building infrastructure from design to completion by combining\nLinux systems, open source software, and 3rd party services.</li>\n<li>Production experience with Amazon Web Services (AWS), including the following\nproducts: EC2, EC2 Auto Scaling, ELB, VPC.</li>\n<li>Experience operating hybrid infrastructure consisting of both AWS resources\nand physical hardware.</li>\n<li>Experiencing building systems that can tolerate the failure of individual\ninstances without human interaction.</li>\n<li>Experience with Puppet or other modern configuration management tooling.</li>\n</ul>\n\n<h3>Bonus Skills &amp; Experience</h3>\n\n<ul>\n<li>Experience with CloudFormation, Terraform, or other products providing\nInfrastructure-as-code workflows.</li>\n</ul>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in joining us. Just fill out our application <a href=\"https://jobs.lever.co/github/93496492-7504-4625-a2ae-78cbbf2cc28d/apply\">here</a>.</p>\n","company":"GitHub","company_url":"https://jobs.lever.co/github","company_logo":"http://github-jobs.s3.amazonaws.com/24d04258-7384-11e5-96b2-69d74eec6e9b.png","url":"http://jobs.github.com/positions/292516f8-7384-11e5-9259-81adabea2f2d"},{"id":"b18fd522-71cd-11e5-8263-250c0331c09d","created_at":"Thu Oct 13 17:13:16 UTC 2016","title":"Systems Engineer","location":"Remote","type":"Full Time","description":"<p>GitHub is looking for engineers to expand our Systems organization. The Systems organization is responsible for the development of applications and services that enable us to scale the world&#39;s largest code hosting platform. </p>\n\n<p>The Systems team is highly distributed and the right candidate can thrive in an environment of asynchronous communication.  We expect you to have strong written communication skills and be able to create working relationships with coworkers in locations around the globe.</p>\n\n<p>As a Systems engineer you&#39;ll always be challenged to solve unique and interesting problems that have real impact on how the world builds software.</p>\n\n<h3>Responsibilities</h3>\n\n<ul>\n<li>Develop and maintain applications and services that interact with key parts of GitHub&#39;s infrastructure</li>\n<li>Understand different metrics for measuring services to ensure performance, scalability and stability</li>\n<li>Contribute to and grow the open source projects developed by GitHub</li>\n<li>Find ways to leverage existing systems to enhance scalability and performance for our platform</li>\n<li>Work with our Infrastructure team to ensure the uptime and reliability of our infrastructure</li>\n</ul>\n\n<h3>Desired Skills &amp; Experience</h3>\n\n<ul>\n<li>Deep understanding of the C programming language</li>\n<li>Strong understanding of Linux systems, at both high and low level</li>\n<li>Experience encountering, diagnosing, and resolving performance problems in systems software</li>\n<li>The ability to apply systems design principles in practical applications</li>\n<li>A pragmatic approach to decision making</li>\n</ul>\n\n<h3>Bonus Skills &amp; Experience</h3>\n\n<ul>\n<li>Experience building automation</li>\n<li>Experience with Ruby</li>\n<li>Experience being an open-source contributor</li>\n<li>Experience with other systems languages (C++, Rust, Go)</li>\n<li>Experience with Git internals as a software project (i.e. its design and implementation)</li>\n</ul>\n\n<p><b>About GitHub</b></p>\n\n<p><b>Who we are</b></p>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<p><b>Why you should join</b></p>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy.</p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done.</p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our benefits are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><i>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</i></p>\n\n<p><b>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</b></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in joining us. Just fill out our application <a href=\"https://jobs.lever.co/github/39f5f002-9f53-4ff8-8610-ca5ad9f0efd6/apply\">here</a></p>\n","company":"GitHub","company_url":"https://jobs.lever.co/github","company_logo":"http://github-jobs.s3.amazonaws.com/aa9eed70-71cd-11e5-8978-1cefa7cbc255.png","url":"http://jobs.github.com/positions/b18fd522-71cd-11e5-8263-250c0331c09d"},{"id":"2bfac3fe-03fa-11e5-8e7a-e636ce670b67","created_at":"Thu Aug 25 22:54:31 UTC 2016","title":"Product Help Content Writer","location":"Anywhere","type":"Full Time","description":"<p>We&#39;re looking for a writer to help create user assistance content for sites like <a href=\"https://help.github.com/\">GitHub Help</a> and <a href=\"https://help.github.com/enterprise/2.2/\">GitHub Enterprise Help</a>.</p>\n\n<p>This writer will report to the Documentation Team Manager and work cooperatively with the Documentation team to produce task-based, user-facing help content about the power of GitHub products and tools, tailored to a range of audiences.</p>\n\n<p>If you&#39;re a patient, compassionate writer who loves crafting excellent prose to help people use software, we really want to hear from you!</p>\n\n<h2>RESPONSIBILITIES</h2>\n\n<ul>\n<li>Collaborate with the Documentation team on planning and developing user assistance content for GitHub products and tools, including (but not limited to) GitHub.com, GitHub Pages, and GitHub Enterprise.</li>\n<li>Cooperatively review and edit drafts of user assistance content with other writers on the team.</li>\n<li>Communicate with Support, Product, and Engineering teams about the user feedback, product changes, and technical product information that inform our documentation.</li>\n</ul>\n\n<h2>QUALIFICATIONS</h2>\n\n<ul>\n<li>Ability to create high-quality, long-form user assistance content for software products. </li>\n<li>Strong user advocate, especially for those new to a product or website.</li>\n<li>Ability to compassionately give and receive editorial critique. -</li>\n<li>Excellent communication skills, especially when working with a distributed team. (The --Documentation team is currently entirely distributed.) </li>\n<li>Strong ability to plan, prioritize, and carry out complex writing projects with high attention to detail along the way.</li>\n</ul>\n\n<h2><em>To apply for this position please submit a cover letter along with your resume. Applications without a cover letter will not be reviewed.</em></h2>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in being our <a href=\"https://jobs.lever.co/github/ecdc2535-870d-4c42-af5e-c9815cae2547/apply\">Product Help Content Writer</a>! Just fill out our application here.</p>\n","company":"GitHub","company_url":"https://jobs.lever.co/github","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/2bfac3fe-03fa-11e5-8e7a-e636ce670b67"},{"id":"2a23eb06-dc3b-11e3-9149-14d3aa507c71","created_at":"Mon Jun 13 21:35:36 UTC 2016","title":"Enterprise Support Engineer - Japan","location":"Japan","type":"Full Time","description":"<p>GitHub is looking for full time Enterprise Support Engineers to provide Japanese-language support for our customers in Japan.</p>\n\n<p>Enterprise Support Engineers support our <a href=\"http://enterprise.github.com/\">GitHub Enterprise</a> product, which our customers install and manage in their own virtualization environment.</p>\n\n<p>At GitHub, we take support seriously, and this is not an entry-level position. As an Enterprise Support Engineer, your main responsibility will be to work with our customers in Japan to solve often highly complex support tickets. Tickets are usually opened by customer system administrators, and can include investigating load or networking issues, debugging application errors, discussing feature requests, and many other issues. You&#39;ll work with many teams at GitHub, including our engineering team to prioritize issues and development, our documentation team to improve customer-facing resources, and our sales team to guide technical conversations with potential customers.</p>\n\n<p>The role is based in Japan, and requires some national and international travel.</p>\n\n<p>The Enterprise Support team is distributed around the world to provide support to our customers 24 hours a day, everyday. Our team works remotely, communicating through GitHub and group chat, and several times a year we gather together to meet face to face.</p>\n\n<p>You don’t need to be a Git expert, but you do need to have technical experience and a passion for helping people. </p>\n\n<h3>You must have:</h3>\n\n<ul>\n<li>Significant experience working with and troubleshooting Linux servers</li>\n<li>Enthusiasm for working directly with customers</li>\n<li>Ability to communicate technical information clearly</li>\n<li>Stellar Japanese and grammar skills</li>\n<li>Business level English skills</li>\n<li>Ability to look through and understand code (Ruby / Bash)</li>\n<li>Must be legally authorized to work in Japan</li>\n</ul>\n\n<h3>We&#39;d also love you to have:</h3>\n\n<ul>\n<li>Familiarity with some flavor of production-level virtual machine (e.g., VMware ESX, Xen, KVM)</li>\n<li>Experience with server automation systems like Chef or Puppet</li>\n<li>Familiarity with Git and GitHub</li>\n</ul>\n\n<p><em>*Your application should be in English, but a Japanese resumé is fine. The application process will include interviews in both English and Japanese.</em></p>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over five million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p>We have a lot of exciting things to do, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. Remote GitHubbers also come visit SF often and are encouraged to stay as long as they like!   </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a> are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n","how_to_apply":"<p>Interested? <a href=\"https://jobs.lever.co/github/4b44f281-e118-49ae-b88e-697aacae7d05/apply\">Fill out our application here.</a> We love hearing about past projects and what interests you. Please make sure you provide a link to your GitHub profile!</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/2a23eb06-dc3b-11e3-9149-14d3aa507c71"},{"id":"bf6cca02-d2fa-11e2-80d6-64ea2ef33dde","created_at":"Tue May 31 21:35:36 UTC 2016","title":"Technical Support","location":"Anywhere","type":"Full Time","description":"<p>The GitHub Technical Support team is looking for full-time team members in our SF office or worldwide! We are particularly in need of folks in Asia-Pacific and Europe. GitHub users work 24/7, so you&#39;ll occasionally need to adjust your work week to help cover a weekend or holiday (don&#39;t worry! We strongly support flexible schedules that let you to take care of the important things in your life).</p>\n\n<p>When GitHub users have questions, they contact <a href=\"https://github.com/contact\">Support</a> and we help them as quickly and awesomely as possible. Technical support handles a wide variety of inquiries including questions about Git and GitHub workflows, GitHub Pages, our API, and our desktop applications. Support also works closely with the engineering team to track down bugs and improve our documentation.</p>\n\n<p>The most important characteristic of our support team is that we love helping developers. GitHub is a place for people to work better, together. Our job is to help. Support treats users the way we&#39;d want someone to treat our friends.</p>\n\n<p>Our support teammates have excellent writing chops: stellar grammar, charming written personality, and the ability to explain complicated things simply. We measure our success in swiftness, accuracy, and clarity.</p>\n\n<p>You must have:</p>\n\n<ul>\n<li>Stellar English and grammar skills</li>\n<li>Excellent problem solving skills – you might not know all the answers but you know how to find and communicate the solution</li>\n<li>A strong sense of empathy – you are attuned to hear the question behind a question</li>\n<li>Technical experience and exposure to programming </li>\n<li>Customer service experience </li>\n<li>A unique writing style and voice</li>\n</ul>\n\n<p>Bonus if you:</p>\n\n<ul>\n<li>Will love developers and GitHub as much as we do</li>\n<li>Could effortlessly explain how Git works to a non-developer</li>\n<li>Have remote customer service experience</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over five million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. Remote GitHubbers also come visit SF often and are encouraged to stay as long as they like!   </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a> are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n","how_to_apply":"<p>Interested? <a href=\"https://jobs.lever.co/github/80a0a622-be2a-4800-9029-a401631a390a/apply\">Fill out our application here</a>. We want our interactions with users to be memorable, so please make your cover letter memorable as well. Tell us about how you match up to the Support characteristics, and what makes you a wonderful person to have around.  Please make sure you provide a link to your GitHub profile!</p>\n","company":"GitHub","company_url":"https://github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/adf1baca-05d7-11e3-918e-ae67779e6df2.png","url":"http://jobs.github.com/positions/bf6cca02-d2fa-11e2-80d6-64ea2ef33dde"},{"id":"35ead430-5e54-11e5-9569-83bb769645f0","created_at":"Sat Jan 02 22:25:47 UTC 2016","title":"Services Engineer","location":"United States","type":"Full Time","description":"<h1>Services Engineer</h1>\n\n<p>The Professional Services team at GitHub focuses on helping customers successfully get started and grow with GitHub. The Services Engineer is a combined consulting services and customer training role. We&#39;re looking for an amazing individual who loves to connect with people and help them solve problems with GitHub.</p>\n\n<p>GitHub is an amazing platform that can revolutionize the way organizations work. We want to help our customers by giving them a great experience from the very beginning of their use of the platform.</p>\n\n<p>As a Services Engineer, you&#39;ll be the expert that:</p>\n\n<ul>\n<li>Helps organizations properly implement and expand their GitHub usage</li>\n<li>Works with customers on-site and remotely to get started on the GitHub platform. This entails:\n\n<ul>\n<li>Implementing GitHub Enterprise and integration with customers&#39; existing infrastructure</li>\n<li>Educating customers about the GitHub workflow through hands-on demonstration</li>\n<li>Developing and updating materials and tools to aid customers in their ongoing use of the GitHub platform</li>\n<li>Documenting and sharing best practices and standards with GitHub customers</li>\n</ul></li>\n</ul>\n\n<p>During customer engagements, areas of focus may include:</p>\n\n<ul>\n<li>Organization administration - help define and implement a strategy for orgs, teams, permissions, and LDAP/Active Directory/Single-sign-on integration</li>\n<li>Infrastructure administration - advise and set up backup, recovery, high-availability, monitoring, upgrades, GitHub support flow</li>\n<li>Platform integrations - discuss options for integrating 3rd party services with GitHub (examples: CI, chat, project management &amp; issue trackers)</li>\n<li>Platform customization - assist customers in learning and employing the GitHub API to customize their workflow</li>\n</ul>\n\n<p>Customers have a wide variety of development processes and tools. To best guide customers, the ideal candidate will have many of the following attributes:</p>\n\n<ul>\n<li>Experience with Git and GitHub</li>\n<li>Software development experience and an understanding of several of these methodologies and tools:\n\n<ul>\n<li>Software development methods such as Agile, Scrum, Lean, Waterfall</li>\n<li>Software project tools like JIRA, Pivotal Tracker, Trello, Asana, and MS Project</li>\n<li>Development environments like Eclipse, Xcode, VisualStudio, IntelliJ, and NetBeans</li>\n<li>Continuous integration and build automation with Jenkins, TeamCity, TFS, TravisCI, CircleCI</li>\n</ul></li>\n<li>Experience configuring the following technologies:\n\n<ul>\n<li>LDAP, ActiveDirectory, and other SAML/Single-Sign-on services</li>\n<li>VMware vSphere, ESXi, and other virtual infrastructure tools</li>\n</ul></li>\n<li>Demonstrated ability to connect with people, lead client projects, and help clients solve problems with GitHub</li>\n<li>Strong ability to manage client expectations and project scope before and during client engagements</li>\n</ul>\n\n<p>Candidates must have authorization to work in the US for this role and be willing to travel 50%.</p>\n\n<p>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</p>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in becoming a Services Engineer at GitHub! <a href=\"https://jobs.lever.co/github/09355914-fb82-4987-ba74-e5dee4b585a4/apply\">Just fill out our application here</a></p>\n","company":"GitHub","company_url":"http://www.github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/35ead430-5e54-11e5-9569-83bb769645f0"},{"id":"a6e53c96-5e51-11e5-845d-6279dafe01fe","created_at":"Sat Jan 02 22:07:29 UTC 2016","title":"Trainer","location":"United States","type":"Full Time","description":"<p>The GitHub Professional Services team is looking to have a talented teacher join our group. The job centers around in-person, virtual, and recorded means of teaching students the best ways to leverage Git and GitHub in the context of collaboratively developing great software. The job involves working with a wide range of GitHub teams, developing and refining curriculum, hosting webinars with customers and curious developers, traveling to customer sites for full-day workshops, and recording asynchronous training sessions in partnership with team members.</p>\n\n<h1>Qualifications:</h1>\n\n<ul>\n<li>Eager to acquire Git and GitHub skills</li>\n<li>Background as a developer or technology teacher</li>\n<li>Ability to convert knowledge into learning experiences</li>\n<li>Ambition to help students learn job skills</li>\n<li>Must possess a relaxed, knowledgeable, and classy disposition in front of people</li>\n<li>Willingness to speak to a wide range of range of audience sizes</li>\n<li>Ability to critically discuss and write debriefs of training events</li>\n<li>Ability to collaborate and work well with others, including clients and team members </li>\n<li>Strong attention to detail </li>\n<li>Must be willing to travel 50% to customer sites</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<h1>We&#39;d love if you have:</h1>\n\n<ul>\n<li>Experience as a technology trainer</li>\n<li>Git and GitHub skills</li>\n<li>Continuous integration and application lifecycle management (ALM) knowledge</li>\n<li>Experience building screencasts</li>\n<li>Great stage presence or ability to be comfortable on camera </li>\n</ul>\n\n<p>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</p>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over ten million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in being our next Trainer at GitHub! <a href=\"https://jobs.lever.co/github/b56f0881-8f45-46d5-b43a-8c8218688194/apply\">Just fill out our application here</a></p>\n","company":"GitHub","company_url":"http://www.github.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/a6e53c96-5e51-11e5-845d-6279dafe01fe"},{"id":"2f1183c2-482d-11e4-9945-68b929fd64d1","created_at":"Sat Jan 02 21:35:36 UTC 2016","title":"Solutions Engineer, Field/Enterprise","location":"United States","type":"Full Time","description":"<h3>Job Summary:</h3>\n\n<p>GitHub helps companies and organizations succeed by allowing them to build better software, together. We&#39;re looking for experienced Solutions Engineers to provide pre- and post-sales support for our rapidly-growing customer base. A Solutions Engineer is responsible for the technical relationships with customers and prospects and works internally with sales and product development to identify and communicate solutions to meet customers&#39; business needs. This person acts as a resource for the sales and customer success teams, our front-line technical support team, and other functional departments within the company.</p>\n\n<p>We&#39;re extremely passionate about the quality of our work. If you are technically sharp and people oriented, you might be a fit for this role!</p>\n\n<h4>Pre-Sales Responsibilities:</h4>\n\n<ul>\n<li>Identifying customer business requirements and matching them to product features</li>\n<li>Building joint customer strategies with enterprise sales and field services to encourage product adoption</li>\n<li>Providing live demonstrations of GitHub Enterprise to prospective customers</li>\n<li>Answering GitHub product questions and helping customers and prospects to take full advantage of the GitHub product</li>\n<li>Answering GitHub technical questions and helping customers integrate GitHub with their existing development tools and workflows</li>\n<li>Building relationships with key decision makers, visiting customers on-site, and serving as a customer&#39;s technical point of contact</li>\n<li>Educating prospects on product implementation and usage</li>\n<li>Learning about customers&#39; successes and challenges, sharing customer feedback within GitHub, and advocating for customer interests</li>\n<li>Maintaining awareness of internal GitHub initiatives and the Source Control Management (SCM) industry</li>\n</ul>\n\n<h4>Post-Sales Responsibilities:</h4>\n\n<ul>\n<li>Acting as intermediary between sales and other technical teams to best meet customer needs</li>\n<li>Communicating customer feedback and perspectives to appropriate teams to be considered in product strategy</li>\n<li>Documenting technical considerations, collecting existing articles, and contributing to internal knowledge bases as a resource for other teams, customers, and partners </li>\n</ul>\n\n<h4>Qualifications:</h4>\n\n<ul>\n<li>3+ years of experience in sales/solutions engineering, technical consulting, or system integration project management for enterprise accounts; customer-facing experience is a must</li>\n<li>Ability to travel up to 50%</li>\n<li>Team-oriented and possess strong collaboration skills</li>\n<li>Passionate commitment to quality and success</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Ability to quickly solve technical and business-related challenges</li>\n<li>Able to relate technical concepts to customers of all technical backgrounds</li>\n<li>Knowledge of Source Control Management (SCM) tools and workflows</li>\n<li>Comfortable working in a fast-paced and dynamic environment</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<h4>Preferred Qualifications:</h4>\n\n<ul>\n<li>Experience working in or with large software development teams</li>\n<li>Ability to work across different time zones</li>\n<li>Knowledge of Git and GitHub workflows</li>\n<li>Knowledge of Salesforce.com workflows</li>\n<li>Knowledge of the Software Development Lifecycle (SDLC)</li>\n<li>Knowledge of continuous integration, continuous delivery</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over five million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. Remote GitHubbers also come visit SF often and are encouraged to stay as long as they like!   </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a> are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in being an Enterprise Sales Engineer at GitHub! <a href=\"https://jobs.lever.co/github/c5020530-e0d9-4ca8-af59-088d85d4ea75/apply\">Just fill out our application here.</a></p>\n","company":"GitHub","company_url":"https://github.com","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/2f1183c2-482d-11e4-9945-68b929fd64d1"},{"id":"8c6853a0-8ad3-11e4-8826-faa16a59d773","created_at":"Sat Jan 02 21:35:36 UTC 2016","title":"Solutions Engineer, Inside/Corporate","location":"San Francisco","type":"Full Time","description":"<h3>Job Summary:</h3>\n\n<p>GitHub helps companies and organizations succeed by allowing them to build better software, together. We&#39;re looking for Solutions Engineers to provide pre-sales support for our rapidly-growing customer base. A Solutions Engineer works with sales to identify and communicate solutions to meet customers&#39; business needs. This person acts as a resource for the sales and customer success teams, our front-line technical support team, and other functional departments within the company.</p>\n\n<p>We&#39;re extremely passionate about the quality of our work. If you are technically sharp and people oriented, you might be a fit for this role!</p>\n\n<h4>Responsibilities include:</h4>\n\n<ul>\n<li>Identifying customer business requirements and matching them to product features</li>\n<li>Answering GitHub product questions and helping customers and prospects to take full advantage of the GitHub product</li>\n<li>Answering GitHub technical questions and helping customers integrate GitHub with their existing development tools and workflows</li>\n<li>Educating prospects on product implementation and usage</li>\n<li>Learning about customers&#39; successes and challenges, sharing customer feedback within GitHub, and advocating for customer interests</li>\n<li>Maintaining awareness of internal GitHub initiatives and the Source Control Management (SCM) industry</li>\n<li>Contributing to internal documentation as a resource for other teams, customers, and partners</li>\n</ul>\n\n<h4>Qualifications:</h4>\n\n<ul>\n<li>1-3 years of experience in sales/solutions engineering, technical consulting, technical support, or software development; customer-facing experience a plus</li>\n<li>Team-oriented and possess strong collaboration skills</li>\n<li>Passionate commitment to quality and success</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Ability to quickly solve technical and business-related challenges</li>\n<li>Able to relate technical concepts to customers of all technical backgrounds</li>\n<li>Knowledge of Source Control Management (SCM) tools and workflows</li>\n<li>Comfortable working in a fast-paced and dynamic environment</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<h4>Preferred Qualifications:</h4>\n\n<ul>\n<li>Experience working in or with medium to large software development teams</li>\n<li>Ability to work across different time zones</li>\n<li>Knowledge of Git and GitHub workflows</li>\n<li>Knowledge of the Software Development Lifecycle (SDLC)</li>\n<li>Knowledge of continuous integration, continuous delivery</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over five million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. Remote GitHubbers also come visit SF often and are encouraged to stay as long as they like!   </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a> are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n","how_to_apply":"<p>Interested? We would love to hear more about you and your interest in being an Inside Sales Engineer at GitHub! <a href=\"https://jobs.lever.co/github/7e137b8c-6a9e-4676-ab1c-c900ae813cae/apply\">Just fill out our application here.</a></p>\n","company":"GitHub","company_url":"https://github.com","company_logo":"http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png","url":"http://jobs.github.com/positions/8c6853a0-8ad3-11e4-8826-faa16a59d773"},{"id":"88ec3a36-736a-11e5-8be0-978dfd560a56","created_at":"Wed Dec 30 18:28:30 UTC 2015","title":"Information Security Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Rally Health is looking for an Information Security Engineer to join our IT team. This type of role is a unique personality set that likes to thrive on dealing with vulnerabilities and preventing intrusions. In the situation that an event does take place, this person would help detail the scope and impact and help drive the remediation.</p>\n\n<p>This individual will be responsible for the incident response process as it pertains to our security of our products both internally and externally. They will be working proactively to ensure safety across our organization, and partner with the appropriate teams for the handling of any security incidents. We&#39;ll also expect this individual to perform vulnerability testing across our products. </p>\n\n<p><em>Skills and Requirements:</em></p>\n\n<p>Incident Response:</p>\n\n<ul>\n<li>  Respond to computer security incidents according to the Computer Security Incident Response Policy (CSIRP)</li>\n<li>  Provide guidance to first responders for handling information security incidents</li>\n<li>  Coordinate efforts among multiple business units during response.</li>\n<li>  Provide timely and relevant updates to appropriate stakeholders and decision makers</li>\n<li>  Provide investigation findings to relevant business units to help improve information security posture</li>\n<li>  Validate and maintain incident response plan and processes to address potential threats</li>\n<li>  Compile and analyze data for management reporting and metrics</li>\n</ul>\n\n<p>Threat Management:</p>\n\n<ul>\n<li>  Monitor information security related Web sites (US-CERT, SANS Internet Storm Center, etc.) and mailing lists (DHS Infrastructure, BugTraq, etc.) to stay up to date on current attacks and trends</li>\n<li>  Analyze potential impact of new threats and exploits and communicate risks to relevant business units</li>\n</ul>\n\n<p><em>Qualifications:</em></p>\n\n<ul>\n<li>  Three or more years of technical experience in the information security field, preferably in this particular industry</li>\n<li>  Three or more years of practical experience in an incident response role</li>\n<li>  Advanced knowledge of information systems security concepts and technologies; network architecture; general database concepts; document management; hardware and software troubleshooting; intrusion tools; and computer forensic tools such as EnCaseR and open source alternatives</li>\n<li>  Familiarity with security regulatory requirements and standards (such as NIST 800 series, ISO 2700x series, GLBA, FFIEC)</li>\n<li>  Advanced knowledge and experience with the Apple and Linux operating systems</li>\n<li><p>Working knowledge of and experience in investigating malicious code</p></li>\n<li><p>Demonstrated ability to apply technical and analytical skills in a security environment</p></li>\n<li><p>Ability to work extremely well under pressure while maintaining a professional image and approach</p></li>\n<li><p>Exceptional information analysis abilities; ability to perform independent analysis and distill relevant findings and root cause</p></li>\n<li><p>Strong analytical writing skills to articulate complex ideas clearly and effectively; experience creating and presenting documentation and management reports</p></li>\n<li><p>Team player with proven ability to work effectively with other business units, IT management and staff, vendors, and consultants</p></li>\n<li><p>Strong communication skills such as planning and leading effective meetings, conducting structured interviews to collect information, interpersonal and negotiation skills, and presenting to a variety of audiences</p></li>\n<li><p>Advanced skills to present information to stakeholders and/or decision makers in an effective and professional deliverable</p></li>\n</ul>\n\n<p>Education/Certifications</p>\n\n<ul>\n<li>  Bachelor’s degree in management information systems, computer science, or related discipline is required</li>\n<li>  Postgraduate degrees and certificate programs in relevant areas that demonstrate analytical writing will also be considered</li>\n<li>  CISSP, SANS GCIH or GCFA, CISA, CISM, EnCER certification(s) and preferred but not required</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/6ckuwj\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/7c6edb42-736a-11e5-9bc3-6bdcc2181eaf.png","url":"http://jobs.github.com/positions/88ec3a36-736a-11e5-8be0-978dfd560a56"},{"id":"46abcc6e-7814-11e5-8a4f-61b1e6e019f9","created_at":"Wed Dec 30 16:53:38 UTC 2015","title":"Senior Full Stack Software Engineer Rally Connect","location":"San Francisco, CA or Washington, DC","type":"Full Time","description":"<p>At Rally Health we’re working to revolutionize the face of wellness and health care. In order to directly affect lives and populations at scale, we need a robust and intuitive enterprise platform. </p>\n\n<p>The Rally Connect team is building a next-generation provider search tool which will help our mission of making healthcare easy and affordable for all of us by providing an intuitive experience that connects individuals and families to the best care at the best price for their needs.</p>\n\n<p>We’re building an ecosystem of distributed services using Scala / Akka / Play web applications communicating over HTTP and a distributed message bus and deployed on AWS with Chef, Mesos, and Docker. Join a fun and agile team of talented engineers, learn new skills, and architect successful solutions that can keep up with our high rate of growth!</p>\n\n<p><em>Who you are:</em></p>\n\n<p><em>About you:</em></p>\n\n<ul>\n<li>  <em>Have a passion to reinvent health care</em>; to make it better for the consumer and optimized for our partners</li>\n<li>  <em>Eager to gain valuable experience</em> and grow quickly, along with the rest of us, as we roll our product out to our millions of eligible users</li>\n<li>  <em>Want to make a difference.</em> The products we build as we grow have the opportunity to revolutionize the way people interact with healthcare</li>\n</ul>\n\n<p><em>What you’ll have the opportunity to do:</em></p>\n\n<ul>\n<li>  Work with a great team of engineers located across the nation</li>\n<li>  Architect and design ways to allow management and configuration across multiple product lines</li>\n<li>  Become a Scala web framework expert using Play</li>\n<li>  Build our internal and external REST API in Scala</li>\n<li>  Contribute to intuitive interfaces using AngularJS</li>\n<li>  Gain insight into how each Rally product in the ecosystem works</li>\n</ul>\n\n<p><em>Your skills:</em></p>\n\n<ul>\n<li>  3+ years of real industry experience with Java, Scala, C#, or a similar language</li>\n<li>  Expert-level design experience, including knowledge of common design patterns and relevant libraries</li>\n<li>  A strong desire to grow a team and learn to solve complex problems at scale</li>\n<li>  Familiarity with Scala, or a strong interest to learn</li>\n<li>  Familiarity with both NoSQL and RDBMS databases, especially their strengths and weaknesses</li>\n<li>  Experience working with RESTful APIs</li>\n</ul>\n\n<p><em>It’s even better if you have:</em></p>\n\n<ul>\n<li>  A passion for exploring new technologies and keeping on the cutting edge</li>\n<li>  Played a major or lead role in an agile team</li>\n<li>  Hands-on experience using Scala</li>\n<li>  Experience building rich, interactive client-side applications and understand the limitations reached at scale (Knowledge of AngularJS a plus!)</li>\n<li>  Used various testing frameworks in the past</li>\n<li>  Worked on an Enterprise facing product in the past and understand the best practices</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/215mia\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/43cd7e66-7814-11e5-83c6-5ee7b17c0f2b.png","url":"http://jobs.github.com/positions/46abcc6e-7814-11e5-8a4f-61b1e6e019f9"},{"id":"83f797f2-7813-11e5-90a8-85bc897790fb","created_at":"Wed Dec 30 16:48:11 UTC 2015","title":"Senior Manager, Facilities","location":"San Francisco, CA","type":"Full Time","description":"<p>The Senior Facilities Manager will oversee facilities and site services programs to improve levels of\nservices, cost, efficiencies, employee experience, and overall workplace environment.</p>\n\n<p><em>Major Responsibilities:</em></p>\n\n<ul>\n<li>  Primary liaison between services providers that support facilities to foster better communication, partnerships and enhanced levels of service</li>\n<li>  Assist with facility planning, operations, maintenance, and corporate services</li>\n<li>  Assist with Planning, budgeting, and scheduling facility modifications, including estimates on equipment, labor, materials, furniture, and other related costs</li>\n<li>  Liaise with Building maintenance and janitorial staff</li>\n<li>  Collaborate with other companies to understand and implement current trends and best practices</li>\n<li>  Manage Workplace Services programs to find ways to continuously improve levels of service, cost and efficiency</li>\n<li>  Develop partnerships and ongoing relationships with vendors</li>\n<li>  Inspect buildings, sites and equipment for needed repair / maintenance</li>\n<li>  Respond to emergency maintenance requests. Troubleshoot issues to determine cause and solution</li>\n<li>  Assist with construction project management</li>\n<li>  Maintain records and prepare reports</li>\n</ul>\n\n<p><em>Qualifications:</em></p>\n\n<ul>\n<li>  At least 5 to 7 years facilities site services management experience</li>\n<li>  Bachelor’s Degree</li>\n<li>  Experience overseeing day to day facilities operations is a plus</li>\n<li>  Excellent written and verbal communication</li>\n<li>  Excellent listener and problem solver</li>\n<li>  Strong interpersonal skills with an ability to interact with all levels externally and internally</li>\n<li>  Experience in analyzing information, development of standards, and managing processes</li>\n<li>  Comfortable speaking/communicating to large audiences</li>\n<li>  Must be self-motivated and highly customer-centric</li>\n<li>  Proven ability to work in a fast-paced, ever changing, and high volume department</li>\n<li>  A creative thinker with a proven track record of getting tasks completed</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/g3rnel\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/4012bc92-7813-11e5-8415-fc3da2f8a1bb.png","url":"http://jobs.github.com/positions/83f797f2-7813-11e5-90a8-85bc897790fb"},{"id":"d45004f8-ae75-11e5-8b35-8492f4075325","created_at":"Tue Dec 29 21:48:56 UTC 2015","title":"Technical Account Manager","location":"New York, NY","type":"Full Time","description":"<p>Code Climate is the world&#39;s largest static analysis platform, helping over 50,000 developers improve the health of their codebases. We work hard to provide clear, timely and actionable insights derived from source code. We recently launched the Code Climate Platform, the first open, extensible platform for all types of static analysis.</p>\n\n<p>Code Climate is available on our hosted platform for free for open source projects, and offers paid subscriptions to analyze private source code either on our hosted platform or Code Climate Enterprise, our behind the firewall product. Our customers include Fortune 500s, public and private companies, large and small, with a range of technical sophistication and exposure to static analysis.</p>\n\n<p>As a Technical Account Manager, you’ll work directly with our customers to help them meet their code quality goals using Code Climate. You’ll help onboard new customers, proactively ensure their ongoing success with our solutions and help finds ways for Code Climate to be more useful for their organization. You’ll also work closely with our engineering and customer service teams as a voice for these customers within the company.</p>\n\n<p>As a key part of the external face of Code Climate, we’re looking for someone who strives to provide an amazing experience for customers.</p>\n\n<p>Examples of problems you&#39;ll be solving:</p>\n\n<ul>\n<li>Educating customers and prospects with with unique software development processes and environments about the best way to use Code Climate. </li>\n<li>Guiding customers towards best practices and solutions for their code quality goals, with an eye towards the short, medium and long term. </li>\n<li>Integrating Code Climate into an organization’s existing IT environment -- including source code management, code review tools, and collaboration tools like Trello and Slack. </li>\n<li>Diagnosing issues affecting customers and collaborating with the product engineering team to identify solutions (and creatively suggesting workarounds, when necessary). </li>\n<li>Becoming an active and positive collaborator in the customer’s mission to better improve their code and software development processes by learning about their unique goals, successes and challenges. </li>\n<li>Training clients and promoting wider and deeper Code Climate adoption within their organizations.</li>\n</ul>\n\n<p>You&#39;re awesome because...</p>\n\n<ul>\n<li>You elicit glowing testimonials from customers. </li>\n<li>You communicate clearly, concisely and honestly. Customers trust you. </li>\n<li>You empathize with issues customers face and are compelled to solve them. </li>\n<li>You continually advocate internally on behalf of customers, and can name from memory the problems that our biggest customers face. </li>\n<li>You&#39;re never afraid to strike up a conversation with someone new, online or in person. </li>\n<li>You’re proud of the documentation you write. </li>\n<li>You systematize the right things at the right time. </li>\n<li>You’re comfortable having discussions with both technical and non-technical stakeholders. </li>\n<li>You’re passionate about software development and have either a background in software development or have taken classes in your spare time.</li>\n</ul>\n\n<p>Working at Code Climate</p>\n\n<ul>\n<li>Join a small team of around ten full-time people who love what they do. </li>\n<li>Competitive compensation and meaningful stock options. </li>\n<li>Flexible and generous paid time off including an open vacation policy and maternity/paternity leave. </li>\n<li>Health (PPO), dental and vision insurance. We pay 100% of the premium and 50% of the premium for dependents. </li>\n<li>Company retreats twice a year. So far we&#39;ve gone to Bali and San Diego. </li>\n<li>Opportunities to continue your professional development, including attending tech conferences. </li>\n<li>Dog-friendly office stocked with snacks, drinks and cold-brew iced coffee.</li>\n</ul>\n","how_to_apply":"<p><a href=\"http://grnh.se/jifn7a\">http://grnh.se/jifn7a</a></p>\n","company":"Code Climate","company_url":"http://codeclimate.com","company_logo":null,"url":"http://jobs.github.com/positions/d45004f8-ae75-11e5-8b35-8492f4075325"},{"id":"3416f0cc-ae58-11e5-9ddf-ebdf4a0a85cc","created_at":"Tue Dec 29 18:16:58 UTC 2015","title":"Ruby on Rails Engineer","location":"Iowa City, IA","type":"Full Time","description":"<p>COMPANY DESCRIPTION</p>\n\n<p>HLT is a 2012 Iowa City-born start-up that develops education apps for smartphones and tablets so that busy students can effectively study anytime and anywhere. We are targeting the multi-billion dollar markets for higher education, with a focus on high-stakes exams and classes. Mobile is one of the fastest growing markets in history and HLT has emerged as a market leader with the most popular, highest grossing and most downloaded of all test prep apps on both android and apple devices. By 2016, we intend to use our mobile learning engine to expand beyond test prep.</p>\n\n<p>The company now has 18 total apps, which have had gross sales over $4MM since launch. Despite 250+ competitors in nursing and dental, our initial fields, we have greater mobile market share and mobile revenues than all our direct competitors combined. Our key focus for new fields will be in health science and test prep and we plan to release 15 new apps in the next year with projected sales of over $5MM in 2016.</p>\n\n<p>As an EdTech startup bent on transforming the way learners experience education, our status quo is constant motion. This requires us to embrace change and be bold and imaginative in how we work. The same is true for who we hire. We need smart, tenacious, team-centric people who share our curiosity of the world and learning-obsessed mindset. We need problem solvers who love tackling big challenges and can flex quickly to rapidly moving parts. We need drivers who own their actions and have the propensity for getting this done.</p>\n\n<p>Although what got us here won’t get us there, we hold tightly to a set of core values to Innovate, Captivate, and Educate. These principles are the heartbeat of our company, and we are rigorous in identifying these qualities in the people we hire.</p>\n\n<p>JOB DESCRIPTION</p>\n\n<p>HLT builds apps using modern web and mobile technologies, such as Ruby on Rails, Objective-C, and Java. We operate as a highly collaborative team organized around an agile framework. We are currently seeking a Ruby on Rails Engineer to join our team.</p>\n\n<p>PRIMARY RESPONSIBILITIES</p>\n\n<ul>\n<li>Designing &amp; developing Ruby on Rails applications</li>\n<li>Designing &amp; developing API libraries</li>\n<li>Developing and improving all aspects of our applications (development, testing, deployment, architecture)</li>\n<li>Working with RESTful APIs</li>\n<li>Writing elegant and maintainable code; a feature isn&#39;t done until it&#39;s been tested</li>\n<li>Writing ActiveRecord queries but also unafraid to get hands dirty with SQL</li>\n<li>Creating technical documentation for APIs and component designs</li>\n<li>Providing technical support of applications</li>\n</ul>\n\n<p>QUALIFICATIONS</p>\n\n<ul>\n<li>2 - 3 years of experience in software development</li>\n<li>1 - 2 years of experience creating applications in Ruby on Rails</li>\n<li>1 - 2 years of experience working with PostgreSQL</li>\n<li>Experience working with front-end web technologies (JavaScript, CSS, HTML, etc.)</li>\n<li>Excellent written and oral communication skills</li>\n<li>Self-directed and able to manage your time effectively</li>\n</ul>\n\n<p>BONUS POINTS FOR</p>\n\n<ul>\n<li>Local candidates and/or willingness to relocate</li>\n<li>Experience developing educational apps</li>\n<li>Experience with single page frameworks such as AngularJS, Backbone, Knockout etc….</li>\n<li>Experience optimizing and scaling rails apps</li>\n<li>Experience working in an agile-based project management framework</li>\n</ul>\n\n<p>HLT offers a highly collaborative environment, competitive salary, stock options, and a one-of-a -kind work experience with strong dedication to fostering a happy and productive team. We go above and beyond to make sure HLT is one of the best places to work in the world. Feel free to talk to any of our current employees!</p>\n","how_to_apply":"<p>Please submit your resume and cover letter to our job posting at: <a href=\"https://hltcorp.applytojob.com/apply/ZSiyOc/Software-Engineer-Ruby-On-Rails.html\">https://hltcorp.applytojob.com/apply/ZSiyOc/Software-Engineer-Ruby-On-Rails.html</a></p>\n","company":"Higher Learning Technologies","company_url":"http://www.hltcorp.com","company_logo":"http://github-jobs.s3.amazonaws.com/30e4e152-ae58-11e5-8555-c1f49c189aa8.png","url":"http://jobs.github.com/positions/3416f0cc-ae58-11e5-9ddf-ebdf4a0a85cc"},{"id":"331fb5a8-ae28-11e5-9790-282eecf0ff00","created_at":"Tue Dec 29 12:33:06 UTC 2015","title":"Senior Digital Business Analyst ","location":"London","type":"Full Time","description":"<p>Senior Business Analyst (Digital)</p>\n\n<p>£Competitive + benefits</p>\n\n<p>London</p>\n\n<p>The job:</p>\n\n<p>We’re showing the UK how technology can make the everyday better. Our people are keeping our customers happy with great service, and our network, which has been named as the best in the UK, is keeping their digital lives connected. Empowered, challenged, supported and rewarded, our people are the key to our success. And the Sunday Times agrees. They’ve voted EE one of the Best Big Companies to Work For. This is your chance to join us.</p>\n\n<p>Our Digital Department sits at the heart of our transformation strategy. Joining us as a Senior Technical Business Analyst, we’ll look to you to translate business needs into high-level reports for our Functional Designers and Developers. That means you’ll be analysing, reporting and communicating data across the Digital teams to meet business and customer needs. And using your technical architecture and coding expertise, you’ll have a significant part to play in designing and implementing the solutions to help improve our systems. It’s all part of making sure we deliver the ultimate customer experience, satisfaction and commercial return.</p>\n\n<p>What you’ll do:</p>\n\n<p>Liaise with the Product, Project/Programme and Customer Experience Managers to lead business analysis for EE Digital\nProduce, modify or maintain solutions using a variety of technologies\nIdentify, plan, co-ordinate and conduct design activities within a multi-disciplined team for all stages of development lifecycles\nBe accountable for design and development delivery targets and scheduling your work to ensure daily, weekly and monthly activity targets are met\nWork with on/offshore partners to make sure the necessary skills and resources are allocated to meet objectives in the delivery cycle\nUndertake QA checks on own work completed</p>\n\n<p>You’ll definitely:</p>\n\n<p>Bring excellent requirements/business analysis and technical design skills\nHave an excellent understanding of working in an Agile environment and have experience of Hybris\nKnow a thing or two about writing user stories, screen specifications, UML, and OOAD\nBring great communication skills and be able to work in a challenging environment\nHave development experience building applications for customer focused online services\nBe able to use defined tools, templates and standards to design, create and test simple, well-engineered systems</p>\n\n<p>What’s in it for you:</p>\n\n<p>Competitive salary, Pension, Private Healthcare, Bonus, Company Car or Cash alternative, Life Assurance, 25 days’ holiday, Discounted mobile phone package, Discounted products and services, as well as a range of other benefits</p>\n\n<p>For more information and to apply, please click the apply link.</p>\n","how_to_apply":"<p><a href=\"https://apply.ee.co.uk/vacancy/senior-digital-business-analyst-30049/20076/description/\">https://apply.ee.co.uk/vacancy/senior-digital-business-analyst-30049/20076/description/</a></p>\n","company":"EE","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/a86876e8-ae27-11e5-9757-db874c3d9b07.jpg","url":"http://jobs.github.com/positions/331fb5a8-ae28-11e5-9790-282eecf0ff00"},{"id":"ebe70c1e-ae26-11e5-81ba-7da624804192","created_at":"Tue Dec 29 12:25:20 UTC 2015","title":"Lead UI Software Developer  ","location":"Leeds ","type":"Full Time","description":"<p>Lead Software Engineer (Web/UI)</p>\n\n<p>£Competitive + benefits</p>\n\n<p>Leeds</p>\n\n<p>The job</p>\n\n<p>We’re EE. And our vision is to provide the best network and best service so our customers trust us with their digital lives. That means making sure we’re providing customers with top notch technology and delivering the ultimate multi-screen experience. But we can only achieve our vision if we’ve got great people working for us. So along with investing significantly in a brand new digital infrastructure, we’re also expanding our Digital team. It’s a huge opportunity for digital talent to be part of a large-scale transformation programme that will have a significant impact on the future of EE.</p>\n\n<p>We’re all about helping customers live their digital lives. And it’s our Digital Delivery eService Team who make sure our website delivers a user experience to beat all others. Joining them as Principal Software Engineer, it’ll be down to you to make sure that ee.co.uk delivers a revolutionary customer experience. That means we’ll look to you to provide technical leadership in an Agile environment -mentoring and developing a team as you advise on solutions designed to meet the needs of both the business and our customers. It’s all part of making sure our digital offering is as strong as it can be, helping us to stand out from the crowd and build stronger customer relationships.</p>\n\n<p>What you’ll do:</p>\n\n<p>Identify, plan, co-ordinate and conduct design and development activities within a multi-disciplined team\nBe accountable for design and development delivery targets\nUndertake checks on work completed, ensuring outputs are of the required standard\nLead the review of outputs of 3rd party partners - making sure they meet our time and quality standards\nProvide expert knowledge of development solutions to be used across a multi-branded digital environment\nManage the design and development of technical processes – from initial requirements to implemented offerings</p>\n\n<p>You’ll definitely:</p>\n\n<p>Have HTML 5, CSS 3, JavaScript, SASS, source control, Eclipse, Abode Creative Studio 5 or 6 and Agile methodology experience\nBring excellent knowledge of solution design and software development processes\nHave extensive experience of systems development, design and integration\nBe able to successfully deliver application development or system integration projects using clear project management techniques and methodologies\nKnow a thing or two about analysing and breaking down problems and information using structured frameworks and methodologies\nBe able to present designs and working prototypes to both technical and non-technical audiences</p>\n\n<p>What’s in it for you:</p>\n\n<p>Competitive salary\nPension\nPrivate Healthcare\nBonus\nCompany Car or Cash alternative\nLife Assurance\n25 days’ holiday\nDiscounted mobile phone package\nDiscounted products and services, as well as a range of other benefits</p>\n\n<p>To find out more and to apply, please click the apply link.</p>\n","how_to_apply":"<p><a href=\"https://apply.ee.co.uk/vacancy/lead-ui-software-developer-29860/19887/description/\">https://apply.ee.co.uk/vacancy/lead-ui-software-developer-29860/19887/description/</a></p>\n","company":"EE","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/e60f6ed0-ae26-11e5-8017-9335d5317c25.jpg","url":"http://jobs.github.com/positions/ebe70c1e-ae26-11e5-81ba-7da624804192"},{"id":"473494d8-ad50-11e5-8e79-0d246cfe6861","created_at":"Mon Dec 28 10:48:06 UTC 2015","title":"Systems Engineer - DevOps minded (m/f)","location":"New York City","type":"Full Time","description":"<p>Automate the automation - with passion and quality. In our DevOps world, developers have access regardless of where the software runs. It&#39;s your task to design this world, where not only features get shipped faster, but also issues are avoided proactively. Be responsive to business demands and eager to choose the right tools and technology - because &quot;milliseconds matter&quot;. Sounds challenging? Join our team to extend our leading e-commerce cloud platform by spreading the API around the globe!</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Scale our platform and be responsible for its availability</li>\n<li>Design and implementation of a reactive cloud architecture</li>\n<li>Improvement of our continuous deployment chain</li>\n<li>Troubleshooting incidents by being informed upfront with monitoring, logs and metrics</li>\n<li>Having an eye on IT standards and security</li>\n<li>Taking part on on-call rotation (with the team) for production systems</li>\n</ul>\n\n<p>Requirements:</p>\n\n<ul>\n<li>Bachelor&#39;s degree (or higher) in Computer Science and/or equivalent experience/qualification</li>\n<li>3+ years experience as System Engineer and Software Engineer (DevOps culture)</li>\n<li>Strong Debian/Ubuntu skills</li>\n<li>Excellent skills in one major programming language</li>\n<li>Experience with Puppet, Hiera, Vagrant and MCollective</li>\n<li>Orchestration and cluster management experience</li>\n<li>Infrastructure-as-a-Code mentality</li>\n<li>Good English language skills</li>\n<li>Structured, analytic and self-contained method of operations</li>\n<li>Excellent problem solving skills</li>\n<li>Experience/interest in e-commerce solutions</li>\n<li>Aspiration to constantly improve yourself and learn new technologies, concepts, etc.</li>\n<li>Nice colleague and team player, able to communicate and with a good dose of pragmatism</li>\n</ul>\n\n<p>Nice-to-have&#39;s:</p>\n\n<ul>\n<li>RackSpace Cloud Services, Managed Services</li>\n<li>Amazon Web Services</li>\n<li>Advanced JVM knowledge</li>\n<li>ElasticSearch, MongoDB experience</li>\n<li>ELK stack, Graphite, Monit, Icinga</li>\n<li>Docker knowledge</li>\n</ul>\n\n<p>About us:</p>\n\n<p>For doing a good job the work environment is more than important. If you would like to know what makes us different and what drives us, feel free to read through our „sweet spots“ list below which is collected by our dev team. We can‘t be more open and authentic, here we go:</p>\n\n<ul>\n<li>A good team/company (highly skilled people, we care about quality and about each other, team takes responsibilities, we evolve together)</li>\n<li>Produce open-source software</li>\n<li>Modern software development (continuous delivery, agile)</li>\n<li>Cool new stuff: Java 8, async IO, reactive architectures, microservices</li>\n<li>Free trainings &amp; workshops</li>\n<li>Participation in and organization of tech talks, hackathons, meetups and conferences</li>\n<li>Deciding together on tools/approaches</li>\n<li>Flexible (family friendly) work hours &amp; home office</li>\n<li>Modern efficient work equipment: MacBooks, two screens (choose your tools like IDE)</li>\n<li>Multicultural environment as you work close with our German teams</li>\n<li>Great location in the lovely NYC co-working space WeWork</li>\n<li>Working in e-commerce as a booming business field with great opportunities and many challenges on projects with a lot of impact/sales &amp; transaction volume/business value</li>\n</ul>\n","how_to_apply":"<p>Send us your CV + Github profile with some code samples and we will get back to you within 24h!</p>\n","company":"commercetools Inc.","company_url":"http://www.commercetools.com","company_logo":"http://github-jobs.s3.amazonaws.com/3ed91106-ad50-11e5-8338-6cc659f9bcea.png","url":"http://jobs.github.com/positions/473494d8-ad50-11e5-8e79-0d246cfe6861"},{"id":"bd19b72c-aa6d-11e5-8703-b09ba911dad3","created_at":"Thu Dec 24 18:40:00 UTC 2015","title":"Sr. Software Engineer - Ruby on Rails/Elixir","location":"San Francisco, CA, US","type":"Full Time","description":"<p><h3><strong>Bleacher Report, 2nd largest sports website and home of the most minutes/users among sports apps in the U.S. (comScore)</strong><strong>, is seeking a Senior Ruby on Rails Software Engineer with a passion for system architecture and shipping code.</strong></h3><p>Imagine designing and creating services that power the leading digital destination of real-time event coverage. Tackling hard problems while collaborating with smart people in an awesome office environment. Sharing your technical expertise while gaining exposure to the latest technologies.</p><h3><strong>What else you’ll be doing...</strong></h3><ul>    <li>    <p>Building robust and scalable applications in Ruby on Rails and Elixir. </p> </li>   <li>    <p>Driving the evolution of our existing stack to a service-oriented architecture.</p>  </li>   <li>    <p>Working closely with other engineering and product teams to understand end-user requirements, formulate use-cases and translate those into technical solutions.</p>  </li>   <li>    <p>Helping to improve code quality through unit tests, automation and code reviews.</p> </li>   <li>    <p>Coordinating with our DevOps team on releases and the analysis of system performance.</p>    </li></ul><h3><strong>Experience you need...</strong></h3><ul>  <li>    <p>3+ years of experience with Ruby on Rails and the willingness to learn new technologies.</p> </li>   <li>    <p>A demonstrated record of delivering projects on time.</p>    </li>   <li>    <p>OOP and software design experience – knowledge of how to create solutions that are extensible, reusable, scalable and meets desired architectural objectives.</p>  </li>   <li>    <p>B.S. or higher in Computer Science or equivalent experience</p>  </li></ul><h3><strong>Bonus points for...</strong></h3><ul> <li>    <p>A Github profile with contributions to the open-source community</p> </li>   <li>    <p>Excellent written communication and documentation abilities</p>  </li>   <li>    <p>Experience with Node.js, Elixir, Sinatra, Redis and/or PostreSQL</p> </li></ul><p> </p><p>Bleacher Report offers a fast-paced, energetic and agile environment that genuinely values and promotes each person’s unique talents. We combine the agility of a startup environment with the stability and benefits only a company backed by Turner Broadcasting can bring.</p><h3><strong>Benefits and perks include...</strong></h3><ul>    <li>    <p>Competitive salary</p>   </li>   <li>    <p>Variable bonuses based on individual and company performance</p> </li>   <li>    <p>Medical, dental and vision coverage</p>  </li>   <li>    <p>401(K) plan with matching</p>    </li>   <li>    <p>Life Insurance and AD&amp;D, LTD</p> </li>   <li>    <p>Annual conference budget</p> </li>   <li>    <p>Transit stipends</p> </li>   <li>    <p>Subsidized gym memberships</p>   </li>   <li>    <p>The latest technology and equipment you need</p> </li>   <li>    <p>Fully-stocked snack and coffee bar with a variety of food and beverages</p>  </li>   <li>Awesome team events year-round, in and out of the office</li></ul> <img src=\"https://www.applytracking.com/track.aspx/6ngFF\"/></p>\n","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/6ngFP\">https://www.applytracking.com/track.aspx/6ngFP</a></p>\n","company":"Bleacher Report","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/bd19b72c-aa6d-11e5-8703-b09ba911dad3"},{"id":"1a8dae2e-aa6c-11e5-99e4-c67334169e32","created_at":"Thu Dec 24 18:28:18 UTC 2015","title":"Lead Data Analytics Engineer","location":"San Francisco, CA, US","type":"Full Time","description":"<p><p><strong>Bleacher Report, 2nd largest sports website and home of the most minutes/users among sports apps in the U.S. (comScore), is looking for a Lead Data Analytics Engineer. </strong></p><p>We are seeking an engineer with a unique blend of big data experience to bring technical and business perspective as we develop our next generation of analytical tools. This position will focus on data strategy, design, capture, and quality as part of our efforts to optimize growth and user satisfaction.</p><p><strong>What you’ll be doing...  </strong></p><ul>   <li>Provide leadership for projects utilizing cloud-based Big Data technologies</li>    <li>Design, develop, deliver and communicate data models and architectures; ability to emphasize methodology, modeling, and governance</li> <li>Maintain table structures, programs, scripts and documentation to ensure alignment with the overall data strategy and architecture</li> <li>Interface with engineers, product managers and product analysts to understand data needs.</li>  <li>Identify, investigate and resolve data quality issues</li></ul><p><strong>Experience you need...</strong></p><ul>   <li>5+ years in data warehousing and database design</li>   <li>Demonstrated knowledge of data warehousing/business intelligence best practices, methodologies, standards, and architectures</li>   <li>Extensive knowledge of relational database design, logical data modeling, data warehousing, and relational database management systems</li> <li>Knowledge of web analytics platforms like Google Analytics, Webtrends, and/or Omniture/Adobe Analytics.</li>    <li>Experience with Ruby, Node.js and Redshift</li></ul><p><strong>Bonus Points for….</strong></p><ul>    <li>Experience with Kinesis</li>    <li>Experience with Elixir, Sinatra and Redis  </li></ul><p>Bleacher Report offers a fast-paced, energetic and agile environment that genuinely values and promotes each person’s unique talents. We combine the agility of a startup environment with the stability and benefits only a company backed by Turner Broadcasting can bring.</p><p><strong>Benefits and perks include...</strong></p><ul>   <li>Competitive salary</li> <li>Variable bonuses based on individual and company performance</li>   <li>Medical, dental and vision coverage</li>    <li>401(K) plan with matching</li>  <li>Life Insurance and AD&amp;D, LTD</li>   <li>Annual conference budget</li>   <li>Transit stipends</li>   <li>Subsidized gym memberships</li> <li>The latest technology and equipment you need</li>   <li>Fully-stocked snack and coffee bar with a variety of food and beverages</li>    <li>Awesome team events year-round, in and out of the office</li></ul><p> </p> <img src=\"https://www.applytracking.com/track.aspx/6ngD9\"/></p>\n","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/6ngDJ\">https://www.applytracking.com/track.aspx/6ngDJ</a></p>\n","company":"Bleacher Report","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/1a8dae2e-aa6c-11e5-99e4-c67334169e32"},{"id":"b992c218-aa24-11e5-86e6-254eb4349e62","created_at":"Thu Dec 24 09:58:09 UTC 2015","title":"JAVA Software Engineer","location":"Rotterdam","type":"Full Time","description":"<p>JAVA Software Engineer</p>\n\n<p>If you are a creative software engineer and the idea of becoming an expert hacker entices you, then we want to hear from you!</p>\n\n<p>The job\nSecure programming is key to keeping our company healthy. Therefore, we are looking for genuine engineers; craftsmen that share our drive. We offer a challenging learning environment where you can become an expert hacker and penetration tester. You will learn how to create architectures that are inherently secure, and code that reads like poetry. Doing so, you will become an expert on secure programming.</p>\n\n<p>Daily Work</p>\n\n<ul>\n<li>penetration test the Connectis software;</li>\n<li>analyze the security properties of our architectures;</li>\n<li>share secure programming knowledge with colleagues;</li>\n<li>take part in daily stand-ups;</li>\n<li>develop features in our platform;</li>\n<li>extend automated testing framework with more security tests;</li>\n<li>discuss safety features with the product owner;</li>\n<li>review and provide feedback on colleagues’ work.</li>\n</ul>\n\n<p>Minimum Requirements</p>\n\n<ul>\n<li>very good programmer;</li>\n<li>university thinking level;</li>\n<li>with an education or dissertation in exact sciences, ideally computer science or similar;\nvery creative;</li>\n<li>a great software enthusiast;</li>\n<li>wants to become an expert in secure programming;</li>\n<li>likes to share knowledge with his colleagues.</li>\n</ul>\n\n<p>Desired Experience</p>\n\n<ul>\n<li>Java expert;</li>\n<li>hacking experience;</li>\n<li>knowledge about internet security;</li>\n<li>knowledge about Hibernate, PostgreSQL;</li>\n<li>Tomcat, Google Guice, RESTful Web Services;</li>\n<li>knowledge of authorization protocols such as SAML, XACML, OAuth, SCIM;</li>\n<li>knowledge of tools like Maven, Ansible, Mercurial, Selenium;</li>\n<li>experience with Scrum;</li>\n<li>Linux experience.</li>\n</ul>\n\n<p>Application process\nPlease apply through the link you find below and submit a copy of your current CV along with a cover letter. </p>\n\n<p><a href=\"https://connectis.has-jobs.com/java_software_engineer_rotterdam/72015/V819/apply\">Click here to apply</a></p>\n\n<p>For more information about this position you can contact our recruiter Fatima Charbouch (<a href=\"mailto:werk@connectis.nl\">werk@connectis.nl</a>).</p>\n\n<p>Agency calls are not appreciated</p>\n\n<p>Keywords: Job vacancy, Rotterdam, Full- time, Java specialist, Internet security specialist.</p>\n","how_to_apply":"<p><a href=\"https://connectis.has-jobs.com/j/72015/V819/apply\">https://connectis.has-jobs.com/j/72015/V819/apply</a></p>\n","company":"Connectis BV","company_url":"https://www.connectis.nl/","company_logo":"http://github-jobs.s3.amazonaws.com/abecd81a-aa24-11e5-8774-2f0dd8807a30.jpg","url":"http://jobs.github.com/positions/b992c218-aa24-11e5-86e6-254eb4349e62"},{"id":"50f588b8-a906-11e5-9a40-7133309dd969","created_at":"Tue Dec 22 23:50:49 UTC 2015","title":"Web Development Director","location":"San Francisco","type":"Full Time","description":"<p>A consulting firm? To which you say: I wanna be in a startup.  Well, ROI is all startupers and now we help startups grow their marketing technology and reach.</p>\n\n<p>We: </p>\n\n<ul>\n<li>Are proud of our work and are happy to help any way necessary to make our clients successful.</li>\n<li>Have a million projects, ranging from tiny to huge, from simple front-end work to full-stack application design/development.</li>\n<li>Work with Fortune 50 companies and with $50k-of-funding companies.</li>\n<li>Are a rapidly growing marketing/development consulting firm in SOMA.</li>\n<li>Are a bunch of friends and former co-workers who worked very well together in previous roles and decided to build a firm to bring immediate, expert consulting teams to companies great and small to help drive the marketing and sales sides of their businesses forward.</li>\n<li>Hate PowerPoint decks and delivering strategy without following through on implementation.</li>\n<li>Love to make and measure the changes to client sites ourselves.</li>\n<li>Are about 50 people and growing.</li>\n<li>Have a 4-tap kegerator.\nYou: </li>\n<li>Have experience in all things web (CSS, JS, HTML) </li>\n<li>Languages: Javascript, PHP, Python, etc. </li>\n<li>Frameworks/Platforms: Wordpress, Django, Node.js</li>\n<li>Databases: hopefully some SQL, maybe some no-SQL</li>\n<li>Are willing to say what you don&#39;t know and, if necessary, rapidly become proficient in it.</li>\n<li>Want to work on lots of different projects.</li>\n<li>Can define and practice DRY.</li>\n<li>Want to build things correctly rather than quickly.</li>\n<li>Know when to return a 400 rather than a 500.</li>\n<li>Know why floats don&#39;t always respect clears.</li>\n<li>Have an opinion on programming languages, frameworks, libraries, but are happy to use whatever the client is using.</li>\n<li>Meet deadlines.</li>\n<li>Want to be part of the anchor team in a growing development practice.</li>\n<li>Want to mentor and develop junior team members .</li>\n<li>Don&#39;t feel antipathy toward marketing folk.</li>\n<li>Probably get bored cranking away on the same language, same framework, and same business forever and ever and ever.</li>\n<li>Feel re-energized when you create a fresh repo on GitHub.</li>\n<li>Like helping and communicating with clients.</li>\n</ul>\n\n<p>Required Skills and Qualifications: </p>\n\n<ul>\n<li>You have a widely varied range of experience in web development on Linux and examples of how you were able to build new capacities quickly.</li>\n<li>Most importantly, you have enough experience to manage yourself in high-pressure situations, know how to educate yourself and how to work with varied groups of people.</li>\n<li>Let us know where you can help and where you can&#39;t.</li>\n</ul>\n\n<p>This position reports to the CTO.</p>\n","how_to_apply":"<p>Follow the link above to apply directly.</p>\n","company":"ROI·DNA","company_url":"http://www.roidna.com/company/join-us/apply/","company_logo":"http://github-jobs.s3.amazonaws.com/3ad3f29e-a907-11e5-823d-1c910c0c9eb3.png","url":"http://jobs.github.com/positions/50f588b8-a906-11e5-9a40-7133309dd969"},{"id":"fb01efdc-a905-11e5-92a7-3cd7e2f820fe","created_at":"Tue Dec 22 23:46:38 UTC 2015","title":"iOS Developer ","location":"Belmont, CA","type":"Full Time","description":"<p><strong>iOS Developer</strong></p>\n\n<p><strong>RingCentral</strong> provides cloud computing based business phone systems designed for today&#39;s mobile and distributed business world. The RingCentral technology platform eliminates the need for expensive and technically complex on-premise legacy phone systems. By combining a hosted, multi-extension business phone system with advanced voice and fax functionality, RingCentral simplifies business communication for modern, flexible business environments.</p>\n\n<p><strong>We have exceptional opportunity for a smart, experienced Software Engineers to work within our Mobile Applications Development team.</strong></p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li><p>Build robust, high performance, well-structured cross platform foundation library, which will be utilized on iOS, Android, WP and potentially Desktop Platforms.</p></li>\n<li><p>Be a key member of a team developing fast, world class, next generation mobile applications providing the best user experience for cloud business communications solutions that will change how millions interact</p></li>\n<li><p>Create solid implementations and write clear, maintainable code and design documents</p></li>\n<li><p>Collaborate with and learn from designers, product managers, engineers, and executives. Learn and share new technologies with the team</p></li>\n<li><p>Design and build advanced applications for the mobile development platform</p></li>\n<li><p>Collaborate with cross-functional teams to define, design, and ship new features. Unit-test code for robustness, including edge cases, usability, and general reliability.</p></li>\n<li><p>Estimate level of effort, evaluate new options of similar technology, offer suggestions to improve processes, and provide comments on some design aspects.</p></li>\n<li><p>Provide reliable solutions to a variety of problems using sound problem solving techniques</p></li>\n<li><p>Work on bug fixing and improving application performance</p></li>\n<li><p>Performs technical root cause analysis and outlines corrective action for given problems</p></li>\n<li><p>Continuously research, evaluate, and implement new technologies to maximize development efficiency.</p></li>\n</ul>\n\n<p><strong>Qualifications / Requirements:</strong></p>\n\n<ul>\n<li><p>Bachelor&#39;s degree in Computer Science or equivalent practical experience</p></li>\n<li><p>Solid understanding of the <strong>full mobile development life cycle</strong></p></li>\n<li><p>Strong experience in <strong>Native Objective-C and Swift is a huge plus.</strong></p></li>\n<li><p>Extra BIG Bonus -- <strong>C / C++</strong></p></li>\n<li><p>Understand the basic of Linux, can write simple bash scripts, Makefiles, etc.</p></li>\n<li><p>Solid understanding of <strong>data structures and algorithms</strong></p></li>\n<li><p>Strong verbal and written communication skills</p></li>\n<li><p>Strong analytical and problem-solving skills</p></li>\n<li><p>Familiar with agile programming techniques including pair programming, test driven equipment, and continuous integration</p></li>\n</ul>\n\n<p><strong>Ability to thrive in start up environment.  We want candidates with that entrepreneurial spark!</strong></p>\n\n<p><strong>Now, a little more about us...  We:</strong></p>\n\n<ul>\n<li><p>Are gurus at multi-tasking and work in a very fast-paced environment.</p></li>\n<li><p>Are a high energy with a great mix of experienced entrepreneurs, talented engineers, dynamic sales and operations and marketing professionals.</p></li>\n<li><p>We don’t do laundry or provide house-cleaning services as we promote work-life balance but we do stock the kitchen with complimentary beverages, snacks, and provide lunch and breakfast goodies.</p></li>\n<li><p>Provide a comprehensive benefits package including medical/dental coverage, 401K, and life insurance.</p></li>\n<li><p>Are conveniently located off 101/280 and 92 in Belmont, CA.</p></li>\n</ul>\n\n<p>The <strong>RingCentral</strong> environment is fast paced, high octane, success driven, team oriented, and is committed to growing the business in a virtually untapped market. We’re looking for awesome individuals like you to join us!</p>\n\n<p>RingCentral is an Equal Opportunity Employer.</p>\n","how_to_apply":"<p>Please apply to:</p>\n\n<p>E-mail: <a href=\"mailto:ray.chang@ringcentral.com\">ray.chang@ringcentral.com</a></p>\n","company":"RingCentral, Inc.","company_url":"http://www.ringcentral.com/","company_logo":"http://github-jobs.s3.amazonaws.com/b6496492-a905-11e5-90a0-ccc5e0424421.jpg","url":"http://jobs.github.com/positions/fb01efdc-a905-11e5-92a7-3cd7e2f820fe"},{"id":"7863c2b2-a900-11e5-8f16-a170e4c9479c","created_at":"Tue Dec 22 23:06:30 UTC 2015","title":"Android Engineer @ 3D Robotics","location":"San Francisco","type":"Full Time","description":"<p>About 3D Robotics: \nWe&#39;re North America&#39;s largest personal drone company, known for pioneering advanced and easy-to-use consumer drone technology, and for the Pixhawk, the world&#39;s most popular autopilot platform. We&#39;re also an all-around awesome, super exciting place to work. Help us define the next wave of flying machines! These products are totally changing the way we see our world, understand our environment, and get things done. THIS IS ONE OF THE COOLEST THINGS HAPPENING ON THE PLANET RIGHT NOW - JOIN US! ALL CAPS! </p>\n\n<p>Yes, this is a position in a startup! \nWe&#39;re well funded, and we can pay you. But if the two main priorities in your life are inherent security and the ability to rely on things planned months ahead, please stop reading this now and do something else. If curiosity, resilience and clear sense of individual responsibility get you going, please continue reading. You&#39;ll find and we expect a sense of truthfulness (towards oneself, each other and reality, learned the hard way), being demanding (is this the best you can do?) as well as extensiveness (have fun really grasping things in their entirety). </p>\n\n<p>The Role: \nAt 3D Robotics, we&#39;re looking to push the limits of what Android can do to deliver novel experiences to our customers. We want to put full control of drones - with autonomous flight and HD video stream - into the hands of our users, and we&#39;re looking for an experienced Android Developer to help us. </p>\n\n<p>We have a small, tight knit mobile and product team. In joining our team, you&#39;ll have the opportunity to learn from the diverse experiences of our group while at the same time writing apps that interact with (and increasingly define) our drones. </p>\n\n<p>If you&#39;re interested in playing with robots all day to help make our dreams a reality, look no further! </p>\n\n<p>Our Ideal Candidate Has: </p>\n\n<ul>\n<li>5+ years of experience using Java. </li>\n<li>2+ years of experience as an Android Developer. </li>\n<li>Released a consumer-facing Android app (or several!) into production. </li>\n<li>Great knowledge of Android concurrency APIs, and the ability to design, build and debug using these APIs. </li>\n<li>Experience with Android test driven development frameworks. </li>\n</ul>\n\n<p>Bonus Points for: </p>\n\n<ul>\n<li>Familiarity with MAVlink. </li>\n<li>Familiarity with Ardupilot. </li>\n<li>Familiarity with Android wear. </li>\n<li>Familiarity with DroidPlanner/Tower. </li>\n<li>A passion for what we&#39;re building! </li>\n</ul>\n\n<p>Why you should work here: </p>\n\n<ul>\n<li>We&#39;ll trust you to do things right. </li>\n<li>You&#39;d be getting in early in a company going through a massive inflection point. </li>\n<li>You&#39;ll feel satisfied that you&#39;re creating something that people love. </li>\n<li>We are working on something awesome! Join us! </li>\n<li>We&#39;ll pay you a competitive salary plus equity, along with all the traditional benefits and some not-so-traditional ones, like a vacation policy that&#39;s on the honor system.</li>\n</ul>\n","how_to_apply":"<p><a href=\"http://grnh.se/g72f5m\">http://grnh.se/g72f5m</a></p>\n","company":"3D Robotics","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/7863c2b2-a900-11e5-8f16-a170e4c9479c"},{"id":"b312d55e-a8ee-11e5-817c-396c3a790de4","created_at":"Tue Dec 22 20:59:03 UTC 2015","title":"Senior Web/Mobile Solutions Developer","location":"Toronto","type":"Full Time","description":"<p>Full job description here: <a href=\"https://utoronto.taleo.net/careersection/10000/jobdetail.ftl?job=1501332\">https://utoronto.taleo.net/careersection/10000/jobdetail.ftl?job=1501332</a></p>\n\n<p>The incumbent will act as team lead for specific projects, perform peer code review and, along with the manager, set technical architecture and coding standards.</p>\n\n<p>As a senior member of a development team, the incumbent provides services personally, and assists other team members as necessary, in the specification, design, development, documentation and implementation of data-driven web and mobile applications, including:  needs analysis, interface design, programming, documentation and handover in adherence with established standards; interface and integration with enterprise systems and Cloud services; testing, maintenance and client support.</p>\n\n<p>Skills:\nStrong demonstrable skills in object-oriented and procedural design and programming, particularly in LAMP and mobile application environments; implementation of Internet security protocols, data security practices, and database administration; accessible design practices, privacy and personal data protection legislation. Experience developing for UNIX, Windows, and Mac OS X environments.  Expert level skills developing in a LAMP environment with: PHP frameworks and template engines; Python; modern web markup and programming languages/frameworks (e.g. HTML5, jQuery, AngularJS, Bootstrap, CSS3, SQL, NoSQL, XML).</p>\n\n<p>Expert level skills developing in iOS and Android environments:\niOS; strong OO design and programming skills in Objective-C and/or Swift; familiarity with iOS SDK (e.g. UIKit, Cocoa Touch, Core Data, Core Location); familiarity with xcode.\nAndroid; strong OO design and programming skills in Java (J2EE/ J2ME); familiarity with Android SDK; knowledge of SQLite, MySQL; familiarity with Eclipse.</p>\n\n<p>Demonstrated skills designing and architecting scalable applications. Demonstrated collaborative skills, the ability to work well under pressure, and as both a team leader and team member. Demonstrated initiative and project completion skills. Excellent analytical, problem solving, organizational, and decision making skills. Excellent communication (verbal and written) and interpersonal skills with the ability to communicate well at all levels.</p>\n","how_to_apply":"<p>Apply online at University of Toronto Careers Website - <a href=\"https://utoronto.taleo.net/careersection/10000/jobdetail.ftl?job=1501332\">https://utoronto.taleo.net/careersection/10000/jobdetail.ftl?job=1501332</a></p>\n","company":"OISE - University of Toronto","company_url":"http://www.oise.utoronto.ca","company_logo":"http://github-jobs.s3.amazonaws.com/17d4b22e-a8ee-11e5-8b07-55f83d06492e.png","url":"http://jobs.github.com/positions/b312d55e-a8ee-11e5-817c-396c3a790de4"},{"id":"f28b7e02-a8e9-11e5-94cf-5737e558c3f0","created_at":"Tue Dec 22 20:24:54 UTC 2015","title":"Senior UX Designer","location":"New York, NY","type":"Full Time","description":"<p><IMG SRC=\"https://ad.doubleclick.net/ddm/ad/N4789.1908389GITHUB/B8441308.126853679;sz=1x1;ord=1234567890?\" BORDER=0 WIDTH=1 HEIGHT=1 ALT=\"Advertisement\"></p>\n\n<p>This job is also located in Irving, TX &amp; Warren, NJ</p>\n\n<p><B>Responsibilities<B></p>\n\n<p>The Senior UX Designer will be responsible for user experience and user interface design projects, and working with partners from requirements phase through production delivery. They will follow the processes and standards established by the UX Design Team. </p>\n\n<p>The typical project spans multiple Verizon organizations and this position requires coordination and clear communication across the teams. The UX Designer is responsible for all aspects of the design; from information architecture, wireframe designs, prototypes and audits of production builds in HTML or native mobile platforms.</p>\n\n<p>Partner with stakeholders to establish objectives and business goals for the product.\nProvide project plans scoping the estimated time necessary to deliver project.</p>\n\n<p>Analyze available information regarding customer interactions and competitive market.</p>\n\n<p>Establish information architecture to document and outline expected organization and behavior of product experience.</p>\n\n<p>Create UX documents, designing the detailed screens for an entire experience, as a visual blueprint for the requirements documentation.</p>\n\n<p>Review UX with multiple teams and making necessary edits to accommodate technical or business concerns.</p>\n\n<p>Create prototypes of UX for further analysis and testing.</p>\n\n<p>Review final visual design with UI Design and Front-end lead to validate designs. Once HTML and development teams have built alpha version of product begin weekly audits and feedback to development groups to ensure that the product aligns with what was agreed upon.</p>\n\n<p><B>Qualifications<B></p>\n\n<p>BS Degree in related area or equivalent experience</p>\n\n<p>8+ years of Design experience within consumer products.</p>\n\n<p>A solid understanding of Responsive Design methodologies, and iOS and Android mobile platforms.\nProven experience delivering complex projects.</p>\n\n<p>Excellent documentation, communication and interpersonal skills.</p>\n\n<p>Demonstrated ability to effectively communicate (both written and verbal) at varied levels within an organization.</p>\n\n<p>Excellent analytical and problem-solving abilities.</p>\n\n<p>Eagerness to learn, understand and apply new technologies.</p>\n\n<p>Natural tendency to seek and explore design and technology trends for interactive experiences.\nAbility to analyze and document design processes and independently identify opportunities for improvement.</p>\n\n<p>Demonstrated ability to be a self-starter - Applicant must be able to push ahead with design projects and drive progress with little oversight.</p>\n\n<p>Ability to work effectively both independently, and within a team.</p>\n\n<p>Demonstrated capabilities for creativity and innovation.</p>\n\n<p>Possess a high level of knowledge and proficiency with Adobe CC Suite (Illustrator, Photoshop a must)</p>\n\n<p>Equal Employment Opportunity\nVerizon is a Federal Contractor\nVerizon requests veteran priority referrals\nVerizon is an equal opportunity and affirmative action employer M/F/Disability/Vet.</p>\n","how_to_apply":"<p>Follow the below link to apply:\n<a href=\"https://ad.doubleclick.net/ddm/clk/299833606;126853679;c?http://www.verizon.com/about/work/jobs/4462604-senior-ux-designer--10?cid=pst&amp;bid=&amp;ss=paid\">https://ad.doubleclick.net/ddm/clk/299833606;126853679;c?http://www.verizon.com/about/work/jobs/4462604-senior-ux-designer--10?cid=pst&amp;bid=&amp;ss=paid</a></p>\n","company":"Verizon","company_url":"http://Verizon.com/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/ee43dae2-a8e9-11e5-96a2-b11c4937d1dc.jpg","url":"http://jobs.github.com/positions/f28b7e02-a8e9-11e5-94cf-5737e558c3f0"},{"id":"eebb2846-a8e3-11e5-92b6-9522747257fc","created_at":"Tue Dec 22 19:41:35 UTC 2015","title":"Manager, Software Development ","location":"Toronto, ON","type":"Full Time","description":"<p>Job Description</p>\n\n<p>At Achievers, our software delivers the only true cloud Employee Success Platform™; a powerful new way for companies to engage, align, and recognize employees enabling remarkable business success. Every day. </p>\n\n<p>We are looking for a Software Development Manager to join our Leadership team in Toronto.  As a Software Development Manager you will work cross-functionally with Achievers developers and Product Managers to navigate software releases.   You will play a key role coaching developers in technical best practices, managing their career development as well as managing sprint related tasks.    If you thrive in an entrepreneurial company where change and variety are a part of life and you want to work in a place that&#39;s full of people like you - A Players who are great at what they do, share a passion for their work, and know how to have fun – you will love it here!</p>\n\n<p>What would a typical day look like, you ask?  Something like this:</p>\n\n<p>Stop by the kitchen and grab a coffee\nCheck in with the leadership team to plan and execute releases\nEnsure that teams have appropriate product and technical specifications, direction, and best practices to deliver high quality results for every sprint.\nConnect with Product Management to review the Product Roadmap and collaborate on future releases and with other departments to establish the system’s functional and non-functional requirements\nStand up for daily scrum with your team &amp; get aligned!\nContinuously improve and apply your management and leaderships skills\nParticipate in our company-wide daily 9 minute To-The-Point meeting (TTP)\nCollaborate on a software architecture plan that meets the future needs of our clients\nBe a hero - Evolve the existing software system applications and architecture\nResearch new technologies and strategize with the best and brightest for new ideas\nRecognize your peers for being awesome!</p>\n\n<p>Do you have what it takes?  We are looking for:</p>\n\n<p>4+ years of experience  managing software development teams using an agile SDLC\nWalking the Walk when it comes to software architecture, scalability, performance and quality\nA proven track record of effectively managing employees to ensure engagement, morale and performance\nHighly skilled in database technologies (primarily MySQL), conventions and standards in database architecture, optimization, and database sharding\nA Mastermind of GIT &amp; Branching Strategies\nWizard when it comes to SOA, Unit-Testing &amp; what’s needed for software to be continuously integrated &amp; deployed.\nHighly knowledgeable of PHP andPHP frameworks – Especially CodeIgniter\nConfident and excited about front-end technologies including: HTML5, CSS3/SASS, JavaScript, Backbone, and other UI libraries\nB.S. or higher in Computer Science</p>\n","how_to_apply":"<p>Please apply through:\n<a href=\"http://www.achievers.com/careers/job?j=o1PL1fwm\">http://www.achievers.com/careers/job?j=o1PL1fwm</a></p>\n","company":"Achievers","company_url":"http://www.achievers.com","company_logo":"http://github-jobs.s3.amazonaws.com/91a23fb4-a8e3-11e5-8551-11604706b249.PNG","url":"http://jobs.github.com/positions/eebb2846-a8e3-11e5-92b6-9522747257fc"},{"id":"82fba0ba-a8e1-11e5-9a7f-d6adc212a77e","created_at":"Tue Dec 22 19:24:43 UTC 2015","title":"Android Mobile Developer","location":"Toronto, ON","type":"Full Time","description":"<p>About Achievers</p>\n\n<p>At Achievers, our software delivers the only true cloud Employee Success Platform™; a powerful new way for companies to engage, align, and recognize employees enabling remarkable business success. Every day. </p>\n\n<p>We hire ambitious professionals who thrive on their entrepreneurial spirit and want to Change the Way the World Works.  As Achievers employees, we are passionate about disruptive technology, welcome constant change, and understand the value of employee success in the workplace. We enjoy coming to work every day because we believe in our product and L.O.V.E. our culture. Achievers is more than just a software company; we are industry leaders in the HR space.</p>\n\n<p>What would a typical day look like, you ask?  Something like this:</p>\n\n<ul>\n<li>Stop by the Eat InCentre and grab a coffee and a bite to eat </li>\n<li>Participate in daily scrum and work with your team to establish goals for the week<br></li>\n<li>Participate in our company-wide daily 9 minute To-The-Point meeting (TTP)</li>\n<li>Research new technologies and strategize with the best and brightest for new ideas</li>\n<li>Recognize your peers for being awesome!</li>\n</ul>\n\n<p>About the Opportunity</p>\n\n<p>As an Android Developer on our Mobile team you will be working with the latest and greatest technologies to help bring cutting edge design &amp; interfaces to life. Leaving customers in awe of the features you create is your mission. If you are an experienced Android Developer with a passion for technology and an eye for design you’ll fit right in!</p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li>Supporting a wide variety of Android devices and versions from 4.x and up</li>\n<li>Building of apps that communicate with a backend service through a RESTFul HTTP API</li>\n<li>Accurately estimating work effort required to complete stories</li>\n<li>Breaking down large, complex features into smaller, workable deliverables</li>\n<li>Collaborating with developers to architect scalable, testable, maintainable object-oriented code</li>\n<li>Unit testing of code for the highest of quality, robustness, and code coverage</li>\n<li>Participating in code reviews providing and receiving constructive feedback</li>\n<li>Building of user interfaces to pixel perfect spec</li>\n<li>Researching new technologies to share, and engage with your team</li>\n</ul>\n\n<p>Qualifications</p>\n\n<ul>\n<li>B.Sc. or Masters in Computer Science or relevant field</li>\n<li>2+ years of Native Android Development</li>\n<li>Familiarity with Android Material Design libraries, idioms, and methodologies</li>\n<li>Experience with building a backend service / RESTFul HTTP API with at least one of PHP\nPython, Ruby, or other backend technology</li>\n<li>Experience working within a web framework such as CodeIgnitor, Symfony, Rails, etc.</li>\n<li>Experience working with iOS </li>\n<li>MySQL</li>\n</ul>\n\n<p>For more information, please visit: <a href=\"http://www.achievers.com/careers\">http://www.achievers.com/careers</a></p>\n\n<p>Achievers is an equal opportunity employer and as such does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.  Selection decisions are solely based on job-related factors.</p>\n","how_to_apply":"<p>Please apply through:</p>\n\n<p><a href=\"http://www.achievers.com/careers/job?j=oSFQ1fw8\">http://www.achievers.com/careers/job?j=oSFQ1fw8</a></p>\n","company":"Achievers","company_url":"http://www.achievers.com","company_logo":"http://github-jobs.s3.amazonaws.com/7966e51e-a8e1-11e5-8c89-d2bafee24773.PNG","url":"http://jobs.github.com/positions/82fba0ba-a8e1-11e5-9a7f-d6adc212a77e"},{"id":"3b327bfe-a8dd-11e5-9376-8e4b7893f071","created_at":"Tue Dec 22 18:53:39 UTC 2015","title":"SoftwareTest Developer (Automation)","location":"Toronto, ON","type":"Full Time","description":"<p>At Achievers, our software delivers the only true cloud Employee Success Platform™; a powerful new way for companies to engage, align, and recognize employees enabling remarkable business success. Every day. </p>\n\n<p>We are looking for a  Software Test Developer to join our Test team in our Toronto office.  As a Software Test Developer for our Test team, you will be working with the latest and greatest technologies to come up with innovative ways automate and test our platform.  You will be expected to go outside of the traditional “testing” box to develop testing scripts and tools.</p>\n\n<p>What would a typical day look like, you ask?  Something like this:</p>\n\n<p>Stop by the kitchen and grab a coffee and a bite to eat \nReview any outstanding bugs in JIRA and use your super-human abilities to put out any fires\nParticipate in daily scrum and work with your team to establish goals for the week \nWrite complex queries in MySQL/SQL\nParticipate in our company-wide daily 9 minute To-The-Point meeting (TTP)\n Write test cases with the feature development team \n Develop and run automation scripts using Selenium, Jenkin or any other open source tool\nRecognize your peers for being awesome!</p>\n\n<p>Do you have what it takes?  We are looking for:</p>\n\n<p>1-5 years of automation testing\nExperienced with PHP and Java\nExpert with front-end technologies including: HTML5, CSS3/SASS &amp; JavaScript\nExperience with database technologies (primarily MySQL)\nAutomation experience (Selenium is an asset)\nB.S. or higher in Computer Science</p>\n\n<p>Excited yet?  Here’s more about us …</p>\n\n<p>We hire ambitious professionals who thrive on their entrepreneurial spirit and want to Change the Way the World Works.  As Achievers employees, we are passionate about disruptive technology, welcome constant change, and understand the value of employee success in the workplace. We enjoy coming to work every day because we believe in our product and L.O.V.E. our culture. Achievers is more than just a software company; we are industry leaders in the HR space. For more information, please visit: <a href=\"http://www.achievers.com/careers\">http://www.achievers.com/careers</a> </p>\n\n<p>Achievers is an equal opportunity employer and as such does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.  Selection decisions are solely based on job-related factors.</p>\n","how_to_apply":"<p>Please apply through:</p>\n\n<p><a href=\"http://www.achievers.com/careers/job?j=ozZ31fwm\">http://www.achievers.com/careers/job?j=ozZ31fwm</a></p>\n","company":"Achievers","company_url":"http://www.achievers.com","company_logo":"http://github-jobs.s3.amazonaws.com/a8e12732-a8dc-11e5-8602-67214df7ee90.PNG","url":"http://jobs.github.com/positions/3b327bfe-a8dd-11e5-9376-8e4b7893f071"},{"id":"858cb0c2-a8db-11e5-8a39-ecda42d6e46c","created_at":"Tue Dec 22 18:42:14 UTC 2015","title":"Software Developer","location":"Toronto, ON","type":"Full Time","description":"<p>At Achievers, our software delivers the only true cloud Employee Success Platform™; a powerful new way for companies to engage, align, and recognize employees enabling remarkable business success. Every day. </p>\n\n<p>We are looking for a Software Developer who loves to build world-class software to join our Development team in Toronto.  As a Software Developer on our team you will be working with the latest and greatest technologies to come up with innovative ways to disrupt the HR technology space.  You will be expected to write brilliant code that revolutionizes our platform. If you are innovative, creative and passionate about technology you’ll fit right in!  </p>\n\n<p>What would a typical day look like, you ask?  Something like this:</p>\n\n<p>Stop by the Eat InCentre and grab a coffee\nCheck in with our Agile software planner and update the status of tickets\nWrite awesome code and develop unique features\nStand up for daily scrum with your team &amp; get aligned!\nParticipate in our company-wide daily 9 minute To-The-Point meeting (TTP) Be a hero - map out how to tackle &amp; implement beautiful solutions\nResearch new technologies and strategize with the best and brightest for new ideas\nRecognize your peers for being awesome!</p>\n\n<p>Do you have what it takes?  We are looking for:</p>\n\n<p>-3-5 years of experience as a developer\n-Walking the Walk when it comes to software architecture, scalability, and performance\n-Highly skilled in database technologies (primarily MySQL), conventions and standards in database architecture, optimization, and database sharding\n-A Mastermind of GIT &amp; Branching Strategies\n-Wizard when it comes to SOA, Unit-Testing &amp; what’s needed for software to be continuously integrated &amp; deployed.\n-Highly knowledgeable of PHP frameworks – Especially CodeIgniter\n-Confident and excited about front-end technologies including: HTML5, CSS3/SASS, JavaScript, Backbone, and other UI libraries</p>\n","how_to_apply":"<p>Please apply through: </p>\n\n<p><a href=\"http://www.achievers.com/careers/job?j=oJT31fwq\">http://www.achievers.com/careers/job?j=oJT31fwq</a></p>\n","company":"Achievers","company_url":"http://www.achievers.com","company_logo":"http://github-jobs.s3.amazonaws.com/a8e12732-a8dc-11e5-8602-67214df7ee90.PNG","url":"http://jobs.github.com/positions/858cb0c2-a8db-11e5-8a39-ecda42d6e46c"},{"id":"8c78ca16-736a-11e5-9b25-96526461262d","created_at":"Tue Dec 22 18:28:36 UTC 2015","title":"Senior Mobile Engineer - iOS","location":"San Francisco, CA","type":"Full Time","description":"<p>Purpose, mastery and autonomy. We provide all three at Rally Health (rallyhealth.com), a startup that&#39;s revolutionizing health and the face of health care. Join a passionate mobile team on a mission to empower millions of users to improve wellness and lifestyles through devices they use every day.\nWe are looking for someone to join us and make an impact right now as we prepare to launch a full blown suite of apps on the mobile platform. If you are fascinated by mobile and its endless possibilities, come join us!</p>\n\n<p><em>Things you’re excited about:</em></p>\n\n<ul>\n<li>  iOS development</li>\n<li>  Building products that delight millions of users</li>\n<li>  Continuously improving user experience</li>\n<li>  Joining a team built on a foundation of collaboration and respect</li>\n</ul>\n\n<p><em>You have experience with:</em></p>\n\n<ul>\n<li>  Objective-C / Swift / C++</li>\n<li>  iOS development</li>\n<li>  Server integration (REST endpoints)</li>\n<li>  Released at least one app on the App Store</li>\n<li>  BS, MS or PhD in Computer Science or related field</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/d46tb5\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/80535c92-736a-11e5-8c6e-8ffc694083a6.png","url":"http://jobs.github.com/positions/8c78ca16-736a-11e5-9b25-96526461262d"},{"id":"f2e38a68-6dcd-11e5-9787-2dc10571338f","created_at":"Tue Dec 22 18:20:27 UTC 2015","title":"Senior Mobile Engineer - Android","location":"San Francisco, CA","type":"Full Time","description":"<p>Purpose, mastery and autonomy. We provide all three at Rally Health (rallyhealth.com), a startup that&#39;s revolutionizing health and the face of health care. Join a passionate mobile team on a mission to empower millions of users to improve wellness and lifestyles through devices they use every day.\nWe are looking for someone to join us and make an impact right now as we prepare to launch a full blown suite of apps on the mobile platform. If you are fascinated by mobile and its endless possibilities, come join us!</p>\n\n<p><em>Things you’re excited about:</em></p>\n\n<ul>\n<li>  Android development</li>\n<li>  Building products that delight millions of users</li>\n<li>  Continuously improving user experience</li>\n<li>  Joining a team built on a foundation of collaboration and respect</li>\n</ul>\n\n<p><em>You have experience with:</em></p>\n\n<ul>\n<li>  Java</li>\n<li>  Android development</li>\n<li>  Server integration (REST endpoints)</li>\n<li>  Released at least one app on the Google Play store</li>\n<li>  BS, MS or PhD in Computer Science or related field</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/qb5ua8\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/eb4aa96c-6dcd-11e5-99b2-96a88f67973a.png","url":"http://jobs.github.com/positions/f2e38a68-6dcd-11e5-9787-2dc10571338f"},{"id":"ddbf73e0-7813-11e5-99cd-ac7ab2c6d8be","created_at":"Tue Dec 22 16:50:42 UTC 2015","title":"Senior Back End Software Engineer, Rally Connect","location":"San Francisco, CA or Washington, DC","type":"Full Time","description":"<p>Rally Health (<a href=\"http://www.rallyhealth.com\">www.rallyhealth.com</a>) has a mission to convert healthcare into a consumer-centric platform.\nThe Rally Connect team is building a next-generation provider search tool which will help our mission of making healthcare easy and affordable for all of us by providing an intuitive experience that connects individuals and families to the best care at the best price for their needs.</p>\n\n<p>We’re building an ecosystem of distributed services using Scala / Akka / Play web applications communicating over HTTP and a distributed message bus and deployed on AWS with Chef, Mesos, and Docker. Join a fun and agile team of talented engineers, learn new skills, and architect successful solutions that can keep up with our high rate of growth!</p>\n\n<p>About you:</p>\n\n<ul>\n<li>  Have a passion to reinvent health care; to make it better for the consumer and optimized for our partners</li>\n<li>  Eager to gain valuable experience and grow quickly, along with the rest of us, as we roll our product out to our millions of eligible users</li>\n<li>  Want to make a difference. The products we build as we grow have the opportunity to revolutionize the way people interact with healthcare</li>\n</ul>\n\n<p>Experience relevant to this role:</p>\n\n<ul>\n<li>  An understanding of the challenges with scaling in complex, distributed systems</li>\n<li>  Familiarity with SOA and the ability to debug errors within a distributed services environment</li>\n<li>  Java (4+ years), C# (4+ years), or Scala (2+ years)</li>\n<li>  Familiarity with both NoSQL and RDBMS databases, especially their strengths and weaknesses</li>\n<li>  Working in a high-traffic production environment with strict SLA requirements</li>\n<li>  Building, shipping and scaling REST-ful services</li>\n<li>  Solid computer science fundamentals, problem solving, and analytical skills</li>\n<li>  Clear communication skills and a strong sense of ownership of seeing things through</li>\n</ul>\n\n<p>Bonus points for having experience with:</p>\n\n<ul>\n<li>  Developing, monitoring and managing distributed applications under heavy traffic</li>\n<li>  Functional programming</li>\n<li>  Programming with the actor model</li>\n<li>  AWS (configuring, deploying, managing, monitoring) services and distributed applications</li>\n<li>  Understanding various SDLC processes including agile (i.e. scrum)</li>\n<li>  Distributed systems architecture experience, with API contract definition</li>\n<li>  Chef or similar (Ansible, SaltStack, etc)</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/l3wbr4\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/d84a277a-7813-11e5-86b9-9d1e725299b1.png","url":"http://jobs.github.com/positions/ddbf73e0-7813-11e5-99cd-ac7ab2c6d8be"},{"id":"ddb68a1c-a89e-11e5-8def-41542103d5f4","created_at":"Tue Dec 22 11:27:05 UTC 2015","title":"Senior Frontend Developer","location":"Canada / Montréal","type":"Full Time","description":"<p><strong>Bookwitty is looking for an experienced frontend developer to join our growing Montreal team and help create the best platform for book enthusiasts yet.</strong></p>\n\n<p>You will be working with a group of witty and passionate people to not only develop, but shape the architecture and future of a unique platform that allows people to connect, share knowledge and discover new ideas through books.</p>\n\n<p><strong>Some examples of projects you could be working on:</strong></p>\n\n<ul>\n<li>Help formulate a long term vision for our project’s frontend engineering</li>\n<li>Transform new designs into fully integrated user interfaces</li>\n<li>Evaluate and implement a data binding framework</li>\n<li>Apply best practices to help keep pages maintainable, fast and responsive</li>\n<li>Collaborate with design teams to create compelling interactions</li>\n<li>Provide guidance to other team members</li>\n</ul>\n\n<p><strong>Some of the things you should have experience with or be ready to learn:</strong></p>\n\n<ul>\n<li>Developing solid Javascript libraries</li>\n<li>Coding stellar HTML and CSS</li>\n<li>Using Git</li>\n<li>Having good knowledge of Ruby and Rails’ frontend stack</li>\n<li>Knowing your browser developer tools inside and out</li>\n<li>Upholding usability and accessibility best practices</li>\n</ul>\n\n<p><strong>Bonus skills include:</strong></p>\n\n<ul>\n<li>Interest in cutting edge frontend technologies like ES6, Web Storage, IndexedDB and Service Workers</li>\n<li>Experience with two-way data binding frameworks</li>\n<li>Experience with deploying assets to CDNs</li>\n</ul>\n\n<p><strong>Bookwitty takes great care of its people.</strong></p>\n\n<p>We’ve just set up shop in a brand new Plateau office, minutes away from a metro station and next to more services, restaurants, gyms and pubs than we can keep count of.</p>\n\n<p>Full-time employees benefit from full coverage of health insurance premiums across our medical, dental and vision plan offerings.</p>\n\n<p><strong>About Bookwitty</strong></p>\n\n<p>Bookwitty is an exciting new project that is all about building a community platform, a combination of a factual database, user submissions, scoring, social media, and e-commerce.  This platform is designed for people that love reading, and want to share ideas with each other. The unique platform we’re creating will let people connect, share knowledge and discover new ideas through books.</p>\n\n<p>And thanks to our global network of book enthusiasts, bookstores, publishers and other professionals, this platform to deliver any book – even the most inaccessible – into the hands of people anywhere in the world, at a fair price.</p>\n\n<p>The core of the development team is based in a brand new office in Montreal, right in the heart of the Plateau. Bookwitty’s parent company Keeward has offices in New York, San Francisco, Paris, Brussels, and Beirut.</p>\n","how_to_apply":"<p>Email your resume to <a href=\"mailto:jobs@bookwitty.com\">jobs@bookwitty.com</a></p>\n","company":"Bookwitty","company_url":"http://www.bookwitty.com","company_logo":null,"url":"http://jobs.github.com/positions/ddb68a1c-a89e-11e5-8def-41542103d5f4"},{"id":"07fa9a3a-a89e-11e5-8071-583ea8a23959","created_at":"Tue Dec 22 11:22:44 UTC 2015","title":"Ruby/Rails Developer","location":"Canada / Montréal","type":"Full Time","description":"<p><strong>Bookwitty is looking for an experienced Ruby on Rails developer to join our growing Montreal team and help create the best platform for book enthusiasts yet.</strong></p>\n\n<p>You will be working with a group of witty and passionate people to not only develop, but shape the architecture and future of a unique platform that allows people to connect, share knowledge and discover new ideas through books.</p>\n\n<p><strong>Some examples of projects you could be working on:</strong></p>\n\n<ul>\n<li>Design and develop platform services</li>\n<li>Enhance our development and deployment tools</li>\n<li>Work with other teams to design and plan new features</li>\n<li>Implement caching layers for data stores that include billions of records</li>\n<li>Develop and implement scoring and recommendation engines</li>\n<li>Keep our apps safe by performing code audits and dependency updates</li>\n</ul>\n\n<p><strong>Some of the things you should have experience with or be ready to learn:</strong></p>\n\n<ul>\n<li>Using Ruby on Rails at scale</li>\n<li>Maintaining a solid set of tests</li>\n<li>Using Git</li>\n<li>Developing with multiple data stores such as document-based and graph databases</li>\n<li>Having practical knowledge of front-end technologies such as JavaScript, HTML and CSS</li>\n</ul>\n\n<p><strong>Bonus skills include:</strong></p>\n\n<ul>\n<li>Experience with deploying and scaling on the Heroku platform and / or Amazon Web Services</li>\n<li>Experience with service-oriented architectures</li>\n</ul>\n\n<p><strong>Bookwitty takes great care of its people.</strong></p>\n\n<p>We’ve just set up shop in a brand new Plateau office, minutes away from a metro station and next to more services, restaurants, gyms and pubs than we can keep count of.</p>\n\n<p>Full-time employees benefit from full coverage of health insurance premiums across our medical, dental and vision plan offerings. </p>\n\n<p><strong>About Bookwitty</strong></p>\n\n<p>Bookwitty is an exciting new project that is all about building a community platform, a combination of a factual database, user submissions, scoring, social media, and e-commerce.  This platform is designed for people that love reading, and want to share ideas with each other. The unique platform we’re creating will let people connect, share knowledge and discover new ideas through books.</p>\n\n<p>And thanks to our global network of book enthusiasts, bookstores, publishers and other professionals, this platform to deliver any book – even the most inaccessible – into the hands of people anywhere in the world, at a fair price.</p>\n\n<p>The core of the development team is based in a brand new office in Montreal, right in the heart of the Plateau. Bookwitty’s parent company Keeward has offices in New York, San Francisco, Paris, Brussels, and Beirut.</p>\n","how_to_apply":"<p>Email your resume to <a href=\"mailto:jobs@bookwitty.com\">jobs@bookwitty.com</a></p>\n","company":"Bookwitty","company_url":"http://www.bookwitty.com","company_logo":null,"url":"http://jobs.github.com/positions/07fa9a3a-a89e-11e5-8071-583ea8a23959"},{"id":"f5d707fa-a751-11e5-9e53-64cc43a6a02b","created_at":"Mon Dec 21 23:31:52 UTC 2015","title":"Senior Frontend Engineer","location":"New York, NY","type":"Full Time","description":"<p>At Gin Lane, we’re dedicated to building the best consumer experiences in the world, through storytelling and technology. We believe that the best brands stand for something, and deliver a consistent experience of that belief across all of their touchpoints.</p>\n\n<p>We’re looking for a forward-thinking Senior Javascript Engineer to join our team. The ideal candidate will be a passionate thought-leader that is adept at creating elegant, future-facing experiences. They’ll be working closely with all disciplines in the product team to help create consumer-centric applications that are intelligent and alive.</p>\n\n<p>This is an onsite, full-time position working with our team in New York City.</p>\n\n<p><strong>Requirements</strong></p>\n\n<ul>\n<li>At least 5+ years of professional development experience</li>\n<li>Advanced Javascript expertise</li>\n<li>Knack for creating beautiful frontend experiences</li>\n<li>Solid experience with CSS3 and styling frameworks (e.g. SCSS)</li>\n<li>Experience with React and various state patterns/libraries (e.g. Flux, redux)</li>\n<li>Working knowledge of ES2015/16 and application of syntax via Babel</li>\n<li>Strong drive towards clean, elegant and performant code</li>\n<li>Solid understanding of OOP, functional principles and design patterns</li>\n<li>Solid understanding of the software development process, version control and git</li>\n<li>Experience with Agile project methodologies (e.g. Scrum, Kanban)</li>\n<li>Ability to clearly communicate ideas in written form</li>\n</ul>\n\n<p><strong>Desired</strong></p>\n\n<ul>\n<li>Advanced React expertise</li>\n<li>Advanced frontend animation experience (e.g. CSS3, GSAP, TweenMax, Three.js)</li>\n<li>Expertise in node and express</li>\n<li>Experience with Relay / GraphQL</li>\n<li>Experience with React Native and Cordova</li>\n<li>Experience with isomorphic / universal builds</li>\n<li>Strong understanding of functional programming</li>\n<li>Strong testing ethic and expertise</li>\n</ul>\n\n<p><strong>What it means to join the Gin Lane team:</strong></p>\n\n<p>At Gin Lane, we simplify and humanize consumer experiences to create a frictionless world, through both agency and venture partnerships.\nOur multidisciplinary team of developers, designers, and strategists is driven by empathy for our partners, passion for quality in our craft, persistent curiosity, and the desire to improve the world in which we work.</p>\n\n<p>We form carefully curated, deep partnerships with some of the brightest and most progressive partners in the space. Built upon a shared long-term vision, our close working relationships promote a culture of innovation, collaboration, and a steadfast focus on the end customer.</p>\n\n<p>We work with some of the leading tech and consumer brands and startups. Recent clients include: Harry’s, Warby Parker, Sweetgreen and GE.</p>\n\n<p>We hope that you’ll join us on the journey. Interested?</p>\n","how_to_apply":"<p>Please submit a resume, portfolio and github/code samples to: <a href=\"mailto:tech-jobs@ginlanemedia.com\">tech-jobs@ginlanemedia.com</a> (No recruiters please)</p>\n","company":"Gin Lane","company_url":"http://ginlane.com","company_logo":"http://github-jobs.s3.amazonaws.com/eb3c7778-a74f-11e5-8cef-b416edc46bc4.png","url":"http://jobs.github.com/positions/f5d707fa-a751-11e5-9e53-64cc43a6a02b"},{"id":"8944579c-a827-11e5-9794-823a8409ae65","created_at":"Mon Dec 21 21:13:01 UTC 2015","title":"Senior QA Automation Engineer","location":"Los Angeles, CA","type":"Full Time","description":"<p><strong>Boingo Wireless – one of the Best Places to Work in Los Angeles! – LA Business Journal, 2015</strong>    </p>\n\n<p><strong>Senior QA Automation Engineer:</strong></p>\n\n<p>The Quality Management team is an integral part of the software delivery process at Boingo Wireless. We are looking for a Lead QA Engineer that will be responsible for leading a small team of QA Engineers/Analysts responsible for planning and testing Boingo Products (Web Apps, Billing, Internal Tools/Products on different devices),  Boingo Services (IPTV and Wi-Fi Services) and our Wi-Fi Networks (Network Coverage, Performance, Design) in Agile methodologies.  Great Consumer Experience at our venues are most important to Boingo Wireless and this person will be responsible defining end to end test scenarios for better networks and better user experience for end users.</p>\n\n<p>This position will work closely with various engineering teams, customer support, product management and our partners to build, drive, and implement end to end Quality Assurance objectives &amp; processes.   </p>\n\n<p><strong>RESPONSIBILITIES:</strong></p>\n\n<ul>\n<li>Manage Network Quality for our Retail Venues (Airports), Military Bases and other Hotspot Operators by defining and measuring various Network Performance KPIs.</li>\n<li>Develop End to End, System Test Plan, UAT (User Acceptance Test) plans &amp; Strategies by learning all our Boingo Products &amp; Services and execute those tests in the lab and in the field through functional, integration and load/stress testing.</li>\n<li>Develop Automated &amp; Load/Stress Tests with home grown and some commercial tools (SILK, Selenium, Grinder, Ixia/Spirent Tools)</li>\n<li>Work closely with cross functional team members (developers, product management, customer support, and partners) to prevent, report and resolve product &amp; network design defects.</li>\n<li>Ability to participate in Wireless Standards Committee to drive some of the new roaming and carrier offloading standards (Passpoint, Quality of Services, etc.).</li>\n</ul>\n\n<p><strong>REQUIREMENTS:</strong></p>\n\n<ul>\n<li>Bachelors or Master’s degree preferably in Computer Science/Electrical Engineering with 7-10 years of experience in a QA testing role in ISP, Telecom or Wireless companies.</li>\n<li>Load/Performance Testing Experience using JMeter, Grinder, Ixia or Spirent tools. </li>\n<li>Experience in Automation/Script development (Perl, Shell, etc.) with commercial or home-grown tools. Experience with SILK/Selenium and other tools.</li>\n<li>Thorough understanding and experience in Wireless Technologies (802.11a/b/g/n/ac, Passpoint, 802.11u, Cisco Prime, WLC), Radius (AAA), Networking (TCP/IP, HTTP/XML, VOIP/Video Quality) and Database Technologies.</li>\n<li>Understanding of various Software Development Life Cycles (primarily Agile/Scrum) &amp; Tools (Splunk, Atlassian Suite, Solarwinds, Ekahau, iPerf, Omnipeek and others).</li>\n<li>Excellent written and oral communication skills with the ability to multitask in a fast paced environment where priorities and projects may change more often.</li>\n<li>Ability to travel 25% time for field testing.</li>\n<li>Quick learner and able to take initiative to improve products, tools and processes.</li>\n</ul>\n\n<p><strong>Nice to have:</strong></p>\n\n<ul>\n<li>Hands on experience in coding/programming in C++, Java and/or C#.</li>\n<li>Hands on QA Management/Leadership Experience.</li>\n</ul>\n\n<p>Company Description:  Boingo Wireless, Inc. (NASDAQ: WIFI) helps the world stay connected.  That’s pretty cool considering communication is key to just about everything we do in life. We were voted One of the Best Places to Work simply because we treat our employees well and try to have fun with what we do. Happy employees means better performance, which is a win-win in our book. Our vast footprint of small cell networks covers more than a million DAS and Wi-Fi locations and reaches more than 1 billion consumers annually – in places as varied as airports, stadiums, universities, and military bases.  That’s a lot of peeps depending on our products and services. The Boingo platform is the only monetization engine of its kind, driving revenue through carrier offload, advertising, location-based data analytics, and consumer products like IPTV, high-speed broadband, and Wi-Fi. In addition to public Wi-Fi and DAS networks in large-scale venues, Boingo installs and maintains high-speed networks on military bases and provides broadband and IPTV services to troops in the barracks. Established in 2001 by chairman and EarthLink founder Sky Dayton, the company went public in 2011.</p>\n","how_to_apply":"<p><a href=\"https://app.jobvite.com/j?aj=oNi21fwS&amp;s=GitHub\">https://app.jobvite.com/j?aj=oNi21fwS&amp;s=GitHub</a></p>\n","company":"Boingo Wireless, Inc.","company_url":"http://www.boingo.com","company_logo":"http://github-jobs.s3.amazonaws.com/580f5e4c-a827-11e5-894e-6710329b944f.png","url":"http://jobs.github.com/positions/8944579c-a827-11e5-9794-823a8409ae65"},{"id":"bcb9e93a-a826-11e5-9f7a-89870503e2f8","created_at":"Mon Dec 21 21:07:39 UTC 2015","title":"Software Engineer, R&D","location":"Los Angeles, CA","type":"Full Time","description":"<p><strong>Boingo Wireless – one of the Best Places to Work in Los Angeles! – LA Business Journal, 2015</strong> </p>\n\n<p><strong>Software Engineer, R&amp;D</strong></p>\n\n<p>The Research and Development Engineer will primarily be involved in utilizing Research, development and testing skills and business acumen to create solutions to drive business success. We’re looking for an individual who is passionate about working on Wireless technologies.</p>\n\n<ul>\n<li>Working on new and upcoming Wireless technology standards and protocols</li>\n<li>Working on Mobile platforms and cutting edge web technologies in the Wireless domain</li>\n<li>Working closely with Boingo teams across the company, including Engineering and Marketing.</li>\n<li>Uses skills to develop and test mobile and web frameworks, apps and systems. Create design and/or test documents to meet business objectives</li>\n</ul>\n\n<p><strong>RESPONSIBILITIES:</strong></p>\n\n<ul>\n<li>Willing to work on new technologies and Industry standards in and around Wireless and Networking domains.</li>\n<li>Work with Director of Strategic Programs to architect, build, test solutions as demanded by Business needs</li>\n<li>Quickly ramp up on Amazon Web services technologies following the development, testing and deployment process.</li>\n<li>Lead efforts with the QA team to define release priorities and test plans and priorities; assists in testing of the related activities (planning/debugging/problem resolution) as needed</li>\n<li>Design, develop and test system enhancements to meet business requirements using AWS, node.js or related and then package the changes/additions for release including implementation instructions.</li>\n<li>Perform architecture improvements, and support activities.</li>\n<li>Assist Principle Engineer(s) and/or Director with architectural related tasks.</li>\n<li>Perform other duties/projects as requested by management.</li>\n</ul>\n\n<p><strong>REQUIREMENTS:</strong></p>\n\n<ul>\n<li>Demonstrated 3-6 years of experience with chosen technology stack.</li>\n<li>Demonstrated expertise with UNIX/Windows and Mobile (Android/iOS) platforms.</li>\n<li>4+ years programming and testing experience in any Programming languages C, C++, Java, C# and Scripting languages like JavaScript, Perl, Python or Ruby etc.</li>\n<li>Development experience in node.js/Java or similar frameworks. </li>\n<li>Strong development and testing experience in Windows OS, either using C, C++ or C#.</li>\n<li>Demonstrated experience in development, deployment and testing of mobile apps on either Windows, Android, or iOS platforms</li>\n<li>Demonstrated experience with markup languages like XML and JavaScript scripting language</li>\n<li>Excellent analytical and problem-solving skills, coupled with discretion and sound independent judgment.</li>\n<li>Excellent oral and written communication skills</li>\n<li>Experience of development projects from requirements gathering through testing and deployment.</li>\n<li>Bachelor’s Degree and/or 3-5 years of equivalent development experience or Master’s Degree and/or 2-4 years of equivalent development experience.</li>\n<li>Good understanding of TCP/IP and 802.11 protocol stacks, including development, troubleshooting and testing experience</li>\n<li>Experience in web development technologies, node.js, Apache, PHP or similar.</li>\n<li>Thorough understanding and experience in various Networking protocols (TCP/IP, OSI, 802.11a/b/g/n), Operating Systems (UNIX, Linux, Macintosh, VMWare), AAA (Radius), and Open Source Tools.</li>\n<li>Good overall understanding of Web based frameworks and protocols including HTTP, XML, and SOAP.</li>\n<li>3+ years’ experience working on various Version Control systems like SVN, GIT, CVS, Perforce etc.\nDemonstrated experience in SSL certificates and related security protocols</li>\n</ul>\n\n<p><strong>NICE TO HAVE:</strong></p>\n\n<ul>\n<li>Working experience on Version Control systems like SVN, GIT, CVS, and Perforce etc.</li>\n<li>Understanding on AGILE/Scrum process for iterative development</li>\n<li>Passionate about R&amp;D and developing quick prototypes.</li>\n</ul>\n\n<p>Company Description:  Boingo Wireless, Inc. (NASDAQ: WIFI) helps the world stay connected.  That’s pretty cool considering communication is key to just about everything we do in life. We were voted One of the Best Places to Work simply because we treat our employees well and try to have fun with what we do. Happy employees means better performance, which is a win-win in our book. Our vast footprint of small cell networks covers more than a million DAS and Wi-Fi locations and reaches more than 1 billion consumers annually – in places as varied as airports, stadiums, universities, and military bases.  That’s a lot of peeps depending on our products and services. The Boingo platform is the only monetization engine of its kind, driving revenue through carrier offload, advertising, location-based data analytics, and consumer products like IPTV, high-speed broadband, and Wi-Fi. In addition to public Wi-Fi and DAS networks in large-scale venues, Boingo installs and maintains high-speed networks on military bases and provides broadband and IPTV services to troops in the barracks. Established in 2001 by chairman and EarthLink founder Sky Dayton, the company went public in 2011.</p>\n","how_to_apply":"<p><a href=\"https://app.jobvite.com/j?aj=oUDT1fwb&amp;s=GitHub\">https://app.jobvite.com/j?aj=oUDT1fwb&amp;s=GitHub</a></p>\n","company":"Boingo Wireless, Inc.","company_url":"http://www.boingo.com","company_logo":"http://github-jobs.s3.amazonaws.com/7d9e5574-a826-11e5-8d8e-b03d9d9d1b81.png","url":"http://jobs.github.com/positions/bcb9e93a-a826-11e5-9f7a-89870503e2f8"},{"id":"6e3b6aac-a80f-11e5-885b-189e20639622","created_at":"Mon Dec 21 18:20:30 UTC 2015","title":"Front-End Developer","location":"Berlin, Germany","type":"Full Time","description":"<p><a href=\"http://www.ecosia.org\">Ecosia</a>, or as we like to call it, the search engine that plants trees, is a pioneering social business and one of the first B Corporations in Europe. As part of our mission to cultivate a more environmentally, socially and economically sustainable world, we want to halt and reverse deforestation by planting a billion native trees by 2020. With 2 million users, 30 million searches, and more than 1000 evangelists, we are now looking for a passionate Front-End Developer who will be responsible for delivering a fantastic front-end experience to our users.</p>\n\n<p><strong>What you&#39;ll be doing</strong></p>\n\n<ul>\n<li>Breathing life into product designs with clean, compliant and performant HTML and CSS</li>\n<li>Working on the front-end of our web applications using SASS, Handlebars and Backbone.js with a strong focus on modularity and reusability</li>\n<li>Writing performant Javascript</li>\n<li>Owning and developing our Stylekit project which we share across products -- you’ll help us build beautiful frontends quickly!</li>\n<li>Helping define our technology roadmap and the future of products that drive the entire business</li>\n<li>Working with other members of the product team to plan and execute on projects from conception through to completion</li>\n<li>Helping innovate and improve an industry-leading product with millions of users</li>\n</ul>\n\n<p><strong>What you bring</strong></p>\n\n<ul>\n<li>At least 2 years of front-end development experience</li>\n<li>An excellent taste in design and an eye for detail -- you love to make beautiful products</li>\n<li>Excellent knowledge of HTML5, CSS3, the DOM and Javascript standards</li>\n<li>Familiarity with Photoshop, Illustrator or similar tools -- you can easily tweak and slice a design for implementation</li>\n<li>Experience with CSS preprocessors (SASS/LESS), jQuery, git and Github</li>\n<li>Experience with web accessibility standards, Backbone.js, Gulp, node.js and ES6 are huge bonuses</li>\n<li>You know how to choose the right tool for the job, and you’re eager to learn new skills</li>\n<li>Respect and passion for our <a href=\"http://bit.ly/ecosiacorevalues\">core values</a></li>\n<li>Fluent spoken and written English</li>\n</ul>\n\n<p><strong>What we offer you</strong></p>\n\n<ul>\n<li>The chance to be part of a meaningful challenge</li>\n<li>Fair compensation package to reflect your skills and experience</li>\n<li>Hardware and software you need to excel at your work</li>\n<li>Fantastic office in the heart of the Berlin start-up community (smart colleagues included)</li>\n<li>Flexible working hours and location (anywhere with an Internet connection)</li>\n<li>Space to add your expertise without being rigid about the way things need to be done</li>\n<li>Reimbursement for conferences, courses and books that help you with what you do</li>\n<li>Weekly team breakfasts</li>\n<li>Oh, and coffee, and healthy snacks, we have plenty of both</li>\n</ul>\n\n<p>Please <a href=\"https://ecosia.workable.com/jobs/167845\">apply</a> before January 15, 2016. You will be contacted soon after the deadline with more details.</p>\n\n<p>We recognise that you may need further development in some areas and we encourage you to apply even if you have less experience of some of the requirements for the role. All applicants will receive consideration for employment without regard to race, religion, national origin, sexual orientation, gender identity, age, physical disability or length of time spent unemployed.</p>\n","how_to_apply":"<p>Please apply via <a href=\"https://ecosia.workable.com/jobs/167845\">https://ecosia.workable.com/jobs/167845</a></p>\n","company":"Ecosia","company_url":"https://www.ecosia.org","company_logo":"http://github-jobs.s3.amazonaws.com/5ed62aac-a80f-11e5-855f-c3f049bbef21.jpg","url":"http://jobs.github.com/positions/6e3b6aac-a80f-11e5-885b-189e20639622"},{"id":"c1187bea-a7fe-11e5-8fbd-c26f9a12f99a","created_at":"Mon Dec 21 16:21:57 UTC 2015","title":"Full-Stack Open-Source Software Engineer 80-100% (m/f)","location":"Zürich, Switzerland","type":"Full Time","description":"<p>You can find more information about who Renuo is and what we value <a href=\"https://www.renuo.ch/jobs#more-about-renuo\">here</a>.</p>\n\n<h1>We love</h1>\n\n<ul>\n<li>Open-source</li>\n<li>Pragmatic software engineering</li>\n<li>Excellent quality code</li>\n<li>New stuff</li>\n<li>Discussing ideas</li>\n<li>Working as a team</li>\n<li>To learn</li>\n</ul>\n\n<h1>We believe that</h1>\n\n<ul>\n<li>You only get happy customers by being happy developers</li>\n<li>A thriving environment helps everyone to thrive themselves</li>\n<li>Everyone should be involved in bringing our company forward</li>\n<li>Working should be fun</li>\n</ul>\n\n<h1>What do we offer?</h1>\n\n<ul>\n<li>Complex and versatile projects</li>\n<li>Consequent Scrum</li>\n<li>New technologies you choose</li>\n<li>Work independently and in small teams</li>\n<li>Flexible working hours</li>\n<li>Goodies and social events</li>\n<li>A loyal, young and very competent team</li>\n</ul>\n\n<h1>What do we expect?</h1>\n\n<ul>\n<li>You are a pragmatic programmer</li>\n<li>You studied computer science</li>\n<li>You value high quality</li>\n<li>You are capable of working independently</li>\n<li>You communicate well</li>\n<li>You know HTML5, CSS3, JavaScript</li>\n<li>Nice to have: Ruby on Rails, Django</li>\n</ul>\n\n<h1>And your job?</h1>\n\n<ul>\n<li>Software engineering with open-source technologies</li>\n<li>Ruby on Rails, AngularJS, TypeScript, HTML5, CSS3</li>\n<li>Database design using SQL (Postgres, MySQL)</li>\n<li>Requirements engineering</li>\n<li>Technical assistance and advisory of clients</li>\n<li>Participation in Scrum</li>\n<li>Evaluation and learning of new technologies</li>\n</ul>\n\n<h1>Next step</h1>\n\n<p>Write us an email to <a href=\"mailto:jobs@renuo.ch\">jobs@renuo.ch</a> and send us your CV and/or portfolio.</p>\n\n<p>We are very eager to seeing your GitHub account!</p>\n\n<p><img src=\"https://www.renuo.ch/images/jobs/renuo-social.jpg\" alt=\"Renuo Social\"></p>\n","how_to_apply":"<p><a href=\"mailto:jobs@renuo.ch\">jobs@renuo.ch</a></p>\n","company":"Renuo","company_url":"https://www.renuo.ch/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/c0a1b068-a7e1-11e5-8dd3-218c2a01b8b8.png","url":"http://jobs.github.com/positions/c1187bea-a7fe-11e5-8fbd-c26f9a12f99a"},{"id":"ec359b50-8d32-11e5-9c0a-25ea52d8030f","created_at":"Mon Dec 21 15:42:44 UTC 2015","title":"SENIOR GO DEVELOPER (M/F)","location":"Berlin","type":"Full Time","description":"<p>About us</p>\n\n<p>LOVOO offers a new, unique way of getting to know people. There are already more than 35 million people worldwide using our app to meet new people in their area through mutual interests. A team of more than 170 people works behind the scenes at our locations in Dresden and Berlin. The only thing missing is you! With your support, we want to continue to strengthen and develop the market position of our iPhone and Android app.</p>\n\n<p>Apply now and become a part of our success story!</p>\n\n<p>Your tasks</p>\n\n<ul>\n<li><p>Independent improvement and development of internal Go applications (e.g. modularized Go-Backend, anti-spam systems, analytical tools)</p></li>\n<li><p>Develop innovative software architecture using modern design and architecture patterns (e.g. micro services)</p></li>\n<li><p>Improve code quality through using XP tools (TDD, Refactoring, Pair Programming, CI)</p></li>\n<li><p>Share knowledge and experience across teams through regular chapter events</p></li>\n<li><p>Do exciting work in agile cross-functional teams (like the chat team, the notification team or feed teams)</p></li>\n<li><p>Continuous training through company-wide TechTalks</p></li>\n<li><p>Participate in Hackathons and technology conferences, like dotGo</p></li>\n</ul>\n\n<p>Our requirements</p>\n\n<ul>\n<li><p>A minimum of 1 year experience in working with Go (either professional or through Open Source)</p></li>\n<li><p>Experience in developing medium- to large-scale web applications</p></li>\n<li><p>Strong knowledge of at least one of those languages: Python, C++, Java, Erlang</p></li>\n<li><p>Participation in Open Source projects would be ideal</p></li>\n<li><p>Knowledge of contemporary design and architectural patterns</p></li>\n<li><p>Independent, reliable and structured work ethic</p></li>\n<li><p>Excellent English</p></li>\n</ul>\n\n<p>We offer you</p>\n\n<ul>\n<li><p>The chance to identify new and interesting possibilities in the market and shape the future of one of the fastest growing startups in Europe</p></li>\n<li><p>A nice and friendly work atmosphere in an international team with flat hierarchies</p></li>\n<li><p>Regular exciting team events, free drinks, a daily breakfast and fresh fruit once a week</p></li>\n<li><p>Flexible working hours and a great work-life balance</p></li>\n</ul>\n","how_to_apply":"<p>Please send your application documents including references to <a href=\"mailto:jobs@lovoo.com\">jobs@lovoo.com</a>.</p>\n\n<p>Anja Schulz | Human Resources</p>\n\n<p>T +49 (351) 41887777</p>\n\n<p>LOVOO GmbH</p>\n\n<p>Prager Str. 10 | 01069 Dresden Germany</p>\n","company":"LOVOO GmbH","company_url":"http://inside.lovoo.com/en/jobs/","company_logo":"http://github-jobs.s3.amazonaws.com/d580fc06-8d32-11e5-9b41-3234ddd5395e.jpg","url":"http://jobs.github.com/positions/ec359b50-8d32-11e5-9c0a-25ea52d8030f"}]
